#version: 0.2 - Trained by `huggingface/tokenizers`
i n
r e
Ġ f
e r
e t
Ġ in
Ġ a
i x
o n
Ġ s
c k
Ġ c
l o
l e
( )
o r
Ġ t
Ġ p
Ġ d
Ġf ix
a l
a t
i t
in g
h e
Ġ u
n et
c e
s e
s t
o u
n d
Ġ re
Ġ m
Ġ b
c t
n t
Ġ w
r a
r o
t er
d e
s s
lo ck
i on
a d
Ġ F
i p
Ġ n
ĠF ix
e d
a r
Ġ o
a n
Ġd e
i d
i l
re e
Ġ h
o t
i s
v e
p f
at e
Ġt o
e m
m a
i o
u e
Ġ v
Ġf or
p t
u r
he ck
e x
o ck
Ġu se
g e
a k
b le
Ġ on
Ġo f
b pf
i m
Ġ r
Ġ le
o p
f ter
c p
o l
s h
Ġs t
Ġc heck
i z
ra ce
Ġ k
Ġa nd
d d
Ġs ock
f s
er r
ou t
u t
at ion
e nt
i f
n e
lo w
u l
Ġ lock
c h
Ġ err
Ġu n
i st
Ġerr or
l a
v i
f ree
i c
Ġ R
i al
l y
u n
il ter
- >
a ck
Ġa l
Ġa dd
lo c
Ġm em
Ġt he
s k
v er
e n
Ġp o
he n
Ġw hen
Ġh a
Ġf a
it h
o re
c he
u re
in it
Ġw ith
s b
or y
a ble
l in
Ġp ro
ur ing
Ġ race
ou nd
Ġf ree
f ilter
Ġ g
Ġle ak
Ġmem ory
al l
Ġ A
net filter
u p
r i
iz e
m p
s et
o de
r y
Ġc on
al id
e ct
ou nt
Ġb e
lin k
i g
ce ss
s er
Ġa t
ex t
i le
Ġ x
Ġa c
a fter
re f
' t
c on
h a
Ġha nd
che d
ro m
a m
ip v
r u
vi ce
p a
v o
ip c
L L
V M
Ġ N
lo se
de v
i a
m o
t cp
Ġ l
Ġn ot
ma p
q ue
r m
Ġs k
Ġd is
vo id
e s
S A
a p
r c
Ġu p
8 0
Ġf rom
b ound
c o
ve nt
g et
Ġ e
80 2
Ġ is
Ġa fter
802 1
Ġc all
ne l
U LL
p er
Ġd on
Ġre ad
A L
M A
m m
o f
ĠN ULL
f o
Ġfa il
r t
ct p
m ed
n ce
Ġ P
at a
g ist
l u
Ġa n
or k
b u
n s
p ro
Ġ C
Ġhand l
8 6
a ge
Ġre mo
AL SA
K VM
e re
l s
at h
Ġb pf
ry pt
s ched
Ġt h
Ġp ar
Ġd o
Ġde ref
Ġde vice
W A
m s
t able
in ter
or t
al ue
al loc
it e
Ġb u
ha sh
med ia
R N
f rm
j ect
Ġ lo
Ġc a
c rypt
i ve
u se
Ġ U
Ġin it
8021 1
Ġs et
net link
Ġv alid
Ġal loc
Ġac cess
ru ct
u m
u sb
Ġ S
ere nce
WA RN
t h
t ipc
Ġ I
re vent
p ut
Ġ -
Ġ D
b lock
c m
e e
i r
ack et
Ġup d
O C
c an
c lose
i ss
Ġu sb
ul t
Ġun init
R D
b e
n ot
Ġa void
Ġre f
Ġb y
Ġde ad
gist er
r ite
Ġs h
Ġsock et
Ġpo inter
bound s
c ur
f ore
s ock
t o
Ġ ip
Ġ io
Ġa r
Ġs e
ak e
im er
Ġbe fore
que ue
S B
c ount
i ble
n l
p o
Ġ q
Ġ he
re ct
ar n
Ġ _
Ġm a
ĠR e
Ġfail ure
U SB
p ort
r ou
t r
z er
Ġc le
ul l
ial iz
am e
Ġdead lock
zer o
s ctp
Ġ ex
Ġc o
Ġt ra
Ġd ata
al le
ad d
Ġupd ate
RD MA
Ġ_ _
m c
Ġ T
in d
Ġp ath
ne ct
Ġremo ve
O N
d s
l et
t y
Ġpo ss
rc u
b ack
f a
n g
re ss
re ad
er nel
Ġc an
Ġw arn
Ġn e
ver t
Ġposs ible
I N
p e
p ar
x frm
Ġin v
Ġn f
ma c
Ġsock hash
Ġsk b
crypt o
alle l
c ma
e y
t ls
Ġ "
in t
Ġs y
Ġp ol
al low
ot h
ol d
bu f
Ġpar allel
Ġlo op
C U
f d
f low
i b
n ame
Ġ j
Ġ out
in fo
Ġp ot
ent ial
Ġhandl ing
Ġpot ential
f er
m em
w a
w e
Ġ net
Ġf ile
et h
Ġu ser
Ġr t
ig h
Ġdis allow
table s
rou p
U E
g s
g ing
s ion
v m
iss ing
g roup
l l
Ġ G
Ġ if
st ro
st ruct
Ġre t
Ġm issing
Ġb et
Ġo ver
ĠR CU
Ġderef erence
Ġvalid ate
ng th
Ġwarn ing
stro y
c a
d u
s o
w ork
Ġ E
Ġin f
ad er
im e
Ġk ernel
Ġcon t
ms g
Ġinv alid
v l
Ġ WARN
or rect
ion s
Ġv alue
ur n
ic y
Ġg et
co v
B lu
b l
d is
o oth
u d
w n
et ooth
Ġs ize
Ġd uring
it y
Ġre cur
ct l
la y
Blu etooth
I D
i re
r p
Ġ O
Ġ zero
pt r
op y
ut ex
Ġal low
Ġan not
Ġalloc ation
a se
m ent
n ode
p ol
s p
s ure
s mc
t un
Ġ en
Ġc lose
Ġt ipc
an up
Ġst ate
if y
ĠA void
ir q
r x
s y
t ect
Ġ it
Ġp a
de stroy
Ġle ngth
con nect
Ġret urn
c re
s it
t a
Ġ em
re gister
Ġt un
Ġp age
it ion
Ġde v
sk b
ĠP revent
Ġtra ns
let e
1 9
E T
s c
t ra
le ss
Ġd ou
Ġu s
Ġm ap
de p
ial ize
pa ce
que st
we en
Ġbet ween
Ġover flow
Ġrecur sion
Ġdou ble
K D
R E
d o
l d
p acket
q u
r ing
u ser
v alue
w rite
Ġ M
Ġf al
Ġp revent
Ġre ject
Ġn ull
Ġr c
cp u
Ġcheck s
ig n
Ġhand le
ĠU se
ializ ed
Ġfal se
c i
l ist
p p
u b
Ġs ched
Ġc h
Ġp re
la b
co mp
Ġhandl er
po int
Ġcle anup
L OC
c heck
f in
n c
o m
u cma
Ġ H
Ġin st
Ġin ter
Ġin fo
Ġp acket
Ġu nd
ce s
Ġw ork
ra m
ra y
ro l
Ġn on
il y
Ġh old
Ġsock map
ent ry
Ġadd ress
Ġha sh
Ġpro tect
Ġl ist
Ġannot ate
19 3
Ġrc u
E P
f g
f ou
o k
t ty
le ak
at ed
at ch
ar t
Ġon ly
im it
Ġpo sit
ĠA dd
ĠC heck
Ġhe ader
Ġco mp
Ġpol icy
Ġposit ive
R e
a f
f use
t x
t imer
Ġs ctp
Ġc ra
Ġc orrect
Ġt cp
st a
Ġm o
Ġw a
ip e
Ġk cov
if t
ĠRe ject
fa ult
rp c
193 9
Re vert
2 5
b ind
d ition
h h
s ch
t p
Ġ i
Ġa ss
Ġt ime
at tr
st op
Ġre gister
Ġre quest
de x
de vice
an ge
il l
Ġst ruct
Ġlock ing
Ġun bound
Ġpro per
ru pt
rt r
ĠD on
igh t
dis c
Ġen sure
C P
m ily
r on
s im
Ġ K
Ġ ge
Ġ ext
Ġ queue
er s
Ġs an
Ġs lab
Ġc ount
Ġp er
Ġre set
Ġm ake
Ġv i
Ġk ey
if i
Ġfa mily
Ġbu g
Ġuninit ialized
Ġref count
Ġsh ift
add r
ĠG UE
KD EP
LOC KDEP
Ġpositive s
Ġwa it
Ġunbound ed
A N
c ing
p l
s ize
