{"<|endoftext|>":0,"!":1,"\"":2,"#":3,"$":4,"%":5,"&":6,"'":7,"(":8,")":9,"*":10,"+":11,",":12,"-":13,".":14,"/":15,"0":16,"1":17,"2":18,"3":19,"4":20,"5":21,"6":22,"7":23,"8":24,"9":25,":":26,";":27,"<":28,"=":29,">":30,"?":31,"@":32,"A":33,"B":34,"C":35,"D":36,"E":37,"F":38,"G":39,"H":40,"I":41,"J":42,"K":43,"L":44,"M":45,"N":46,"O":47,"P":48,"Q":49,"R":50,"S":51,"T":52,"U":53,"V":54,"W":55,"X":56,"Y":57,"Z":58,"[":59,"\\":60,"]":61,"^":62,"_":63,"`":64,"a":65,"b":66,"c":67,"d":68,"e":69,"f":70,"g":71,"h":72,"i":73,"j":74,"k":75,"l":76,"m":77,"n":78,"o":79,"p":80,"q":81,"r":82,"s":83,"t":84,"u":85,"v":86,"w":87,"x":88,"y":89,"z":90,"{":91,"|":92,"}":93,"~":94,"¡":95,"¢":96,"£":97,"¤":98,"¥":99,"¦":100,"§":101,"¨":102,"©":103,"ª":104,"«":105,"¬":106,"®":107,"¯":108,"°":109,"±":110,"²":111,"³":112,"´":113,"µ":114,"¶":115,"·":116,"¸":117,"¹":118,"º":119,"»":120,"¼":121,"½":122,"¾":123,"¿":124,"À":125,"Á":126,"Â":127,"Ã":128,"Ä":129,"Å":130,"Æ":131,"Ç":132,"È":133,"É":134,"Ê":135,"Ë":136,"Ì":137,"Í":138,"Î":139,"Ï":140,"Ð":141,"Ñ":142,"Ò":143,"Ó":144,"Ô":145,"Õ":146,"Ö":147,"×":148,"Ø":149,"Ù":150,"Ú":151,"Û":152,"Ü":153,"Ý":154,"Þ":155,"ß":156,"à":157,"á":158,"â":159,"ã":160,"ä":161,"å":162,"æ":163,"ç":164,"è":165,"é":166,"ê":167,"ë":168,"ì":169,"í":170,"î":171,"ï":172,"ð":173,"ñ":174,"ò":175,"ó":176,"ô":177,"õ":178,"ö":179,"÷":180,"ø":181,"ù":182,"ú":183,"û":184,"ü":185,"ý":186,"þ":187,"ÿ":188,"Ā":189,"ā":190,"Ă":191,"ă":192,"Ą":193,"ą":194,"Ć":195,"ć":196,"Ĉ":197,"ĉ":198,"Ċ":199,"ċ":200,"Č":201,"č":202,"Ď":203,"ď":204,"Đ":205,"đ":206,"Ē":207,"ē":208,"Ĕ":209,"ĕ":210,"Ė":211,"ė":212,"Ę":213,"ę":214,"Ě":215,"ě":216,"Ĝ":217,"ĝ":218,"Ğ":219,"ğ":220,"Ġ":221,"ġ":222,"Ģ":223,"ģ":224,"Ĥ":225,"ĥ":226,"Ħ":227,"ħ":228,"Ĩ":229,"ĩ":230,"Ī":231,"ī":232,"Ĭ":233,"ĭ":234,"Į":235,"į":236,"İ":237,"ı":238,"Ĳ":239,"ĳ":240,"Ĵ":241,"ĵ":242,"Ķ":243,"ķ":244,"ĸ":245,"Ĺ":246,"ĺ":247,"Ļ":248,"ļ":249,"Ľ":250,"ľ":251,"Ŀ":252,"ŀ":253,"Ł":254,"ł":255,"Ń":256,"in":257,"re":258,"Ġf":259,"er":260,"et":261,"Ġin":262,"Ġa":263,"ix":264,"on":265,"Ġs":266,"ck":267,"Ġc":268,"lo":269,"le":270,"()":271,"or":272,"Ġt":273,"Ġp":274,"Ġd":275,"Ġfix":276,"al":277,"at":278,"it":279,"ing":280,"he":281,"Ġu":282,"net":283,"ce":284,"se":285,"st":286,"ou":287,"nd":288,"Ġre":289,"Ġm":290,"Ġb":291,"ct":292,"nt":293,"Ġw":294,"ra":295,"ro":296,"ter":297,"de":298,"ss":299,"lock":300,"ion":301,"ad":302,"ĠF":303,"ip":304,"Ġn":305,"ĠFix":306,"ed":307,"ar":308,"Ġo":309,"an":310,"Ġde":311,"id":312,"il":313,"ree":314,"Ġh":315,"ot":316,"is":317,"ve":318,"pf":319,"ate":320,"Ġto":321,"em":322,"ma":323,"io":324,"ue":325,"Ġv":326,"Ġfor":327,"pt":328,"ur":329,"heck":330,"ex":331,"ock":332,"Ġuse":333,"ge":334,"ak":335,"ble":336,"Ġon":337,"Ġof":338,"bpf":339,"im":340,"Ġr":341,"Ġle":342,"op":343,"fter":344,"cp":345,"ol":346,"sh":347,"Ġst":348,"Ġcheck":349,"iz":350,"race":351,"Ġk":352,"Ġand":353,"dd":354,"Ġsock":355,"fs":356,"err":357,"out":358,"ut":359,"ation":360,"ent":361,"if":362,"ne":363,"low":364,"ul":365,"Ġlock":366,"ch":367,"Ġerr":368,"Ġun":369,"ist":370,"Ġerror":371,"la":372,"vi":373,"free":374,"ic":375,"ĠR":376,"ial":377,"ly":378,"un":379,"ilter":380,"->":381,"ack":382,"Ġal":383,"Ġadd":384,"loc":385,"Ġmem":386,"Ġthe":387,"sk":388,"ver":389,"en":390,"Ġpo":391,"hen":392,"Ġwhen":393,"Ġha":394,"Ġfa":395,"ith":396,"ore":397,"che":398,"ure":399,"init":400,"Ġwith":401,"sb":402,"ory":403,"able":404,"lin":405,"Ġpro":406,"uring":407,"Ġrace":408,"ound":409,"Ġfree":410,"filter":411,"Ġg":412,"Ġleak":413,"Ġmemory":414,"all":415,"ĠA":416,"netfilter":417,"up":418,"ri":419,"ize":420,"mp":421,"set":422,"ode":423,"ry":424,"Ġcon":425,"alid":426,"ect":427,"ount":428,"Ġbe":429,"link":430,"ig":431,"cess":432,"ser":433,"Ġat":434,"ext":435,"ile":436,"Ġx":437,"Ġac":438,"after":439,"ref":440,"'t":441,"con":442,"ha":443,"Ġhand":444,"ched":445,"rom":446,"am":447,"ipv":448,"ru":449,"vice":450,"pa":451,"vo":452,"ipc":453,"LL":454,"VM":455,"ĠN":456,"lose":457,"dev":458,"ia":459,"mo":460,"tcp":461,"Ġl":462,"Ġnot":463,"map":464,"que":465,"rm":466,"Ġsk":467,"Ġdis":468,"void":469,"es":470,"SA":471,"ap":472,"rc":473,"Ġup":474,"80":475,"Ġfrom":476,"bound":477,"co":478,"vent":479,"get":480,"Ġe":481,"802":482,"Ġis":483,"Ġafter":484,"8021":485,"Ġcall":486,"nel":487,"ULL":488,"per":489,"Ġdon":490,"Ġread":491,"AL":492,"MA":493,"mm":494,"of":495,"ĠNULL":496,"fo":497,"Ġfail":498,"rt":499,"ctp":500,"med":501,"nce":502,"ĠP":503,"ata":504,"gist":505,"lu":506,"Ġan":507,"ork":508,"bu":509,"ns":510,"pro":511,"ĠC":512,"Ġhandl":513,"86":514,"age":515,"Ġremo":516,"ALSA":517,"KVM":518,"ere":519,"ls":520,"ath":521,"Ġbpf":522,"rypt":523,"sched":524,"Ġth":525,"Ġpar":526,"Ġdo":527,"Ġderef":528,"Ġdevice":529,"WA":530,"ms":531,"table":532,"inter":533,"ort":534,"alue":535,"alloc":536,"ite":537,"Ġbu":538,"hash":539,"media":540,"RN":541,"frm":542,"ject":543,"Ġlo":544,"Ġca":545,"crypt":546,"ive":547,"use":548,"ĠU":549,"Ġinit":550,"80211":551,"Ġset":552,"netlink":553,"Ġvalid":554,"Ġalloc":555,"Ġaccess":556,"ruct":557,"um":558,"usb":559,"ĠS":560,"erence":561,"WARN":562,"th":563,"tipc":564,"ĠI":565,"revent":566,"put":567,"Ġ-":568,"ĠD":569,"block":570,"cm":571,"ee":572,"ir":573,"acket":574,"Ġupd":575,"OC":576,"can":577,"close":578,"iss":579,"Ġusb":580,"ult":581,"Ġuninit":582,"RD":583,"be":584,"not":585,"Ġavoid":586,"Ġref":587,"Ġby":588,"Ġdead":589,"gister":590,"rite":591,"Ġsh":592,"Ġsocket":593,"Ġpointer":594,"bounds":595,"cur":596,"fore":597,"sock":598,"to":599,"Ġip":600,"Ġio":601,"Ġar":602,"Ġse":603,"ake":604,"imer":605,"Ġbefore":606,"queue":607,"SB":608,"count":609,"ible":610,"nl":611,"po":612,"Ġq":613,"Ġhe":614,"rect":615,"arn":616,"Ġ_":617,"Ġma":618,"ĠRe":619,"Ġfailure":620,"USB":621,"port":622,"rou":623,"tr":624,"zer":625,"Ġcle":626,"ull":627,"ializ":628,"ame":629,"Ġdeadlock":630,"zero":631,"sctp":632,"Ġex":633,"Ġco":634,"Ġtra":635,"Ġdata":636,"alle":637,"add":638,"Ġupdate":639,"RDMA":640,"Ġ__":641,"mc":642,"ĠT":643,"ind":644,"Ġpath":645,"nect":646,"Ġremove":647,"ON":648,"ds":649,"let":650,"ty":651,"Ġposs":652,"rcu":653,"back":654,"fa":655,"ng":656,"ress":657,"read":658,"ernel":659,"Ġcan":660,"Ġwarn":661,"Ġne":662,"vert":663,"Ġpossible":664,"IN":665,"pe":666,"par":667,"xfrm":668,"Ġinv":669,"Ġnf":670,"mac":671,"Ġsockhash":672,"Ġskb":673,"crypto":674,"allel":675,"cma":676,"ey":677,"tls":678,"Ġ\"":679,"int":680,"Ġsy":681,"Ġpol":682,"allow":683,"oth":684,"old":685,"buf":686,"Ġparallel":687,"Ġloop":688,"CU":689,"fd":690,"flow":691,"ib":692,"name":693,"Ġj":694,"Ġout":695,"info":696,"Ġpot":697,"ential":698,"Ġhandling":699,"Ġpotential":700,"fer":701,"mem":702,"wa":703,"we":704,"Ġnet":705,"Ġfile":706,"eth":707,"Ġuser":708,"Ġrt":709,"igh":710,"Ġdisallow":711,"tables":712,"roup":713,"UE":714,"gs":715,"ging":716,"sion":717,"vm":718,"issing":719,"group":720,"ll":721,"ĠG":722,"Ġif":723,"stro":724,"struct":725,"Ġret":726,"Ġmissing":727,"Ġbet":728,"Ġover":729,"ĠRCU":730,"Ġdereference":731,"Ġvalidate":732,"ngth":733,"Ġwarning":734,"stroy":735,"ca":736,"du":737,"so":738,"work":739,"ĠE":740,"Ġinf":741,"ader":742,"ime":743,"Ġkernel":744,"Ġcont":745,"msg":746,"Ġinvalid":747,"vl":748,"ĠWARN":749,"orrect":750,"ions":751,"Ġvalue":752,"urn":753,"icy":754,"Ġget":755,"cov":756,"Blu":757,"bl":758,"dis":759,"ooth":760,"ud":761,"wn":762,"etooth":763,"Ġsize":764,"Ġduring":765,"ity":766,"Ġrecur":767,"ctl":768,"lay":769,"Bluetooth":770,"ID":771,"ire":772,"rp":773,"ĠO":774,"Ġzero":775,"ptr":776,"opy":777,"utex":778,"Ġallow":779,"Ġannot":780,"Ġallocation":781,"ase":782,"ment":783,"node":784,"pol":785,"sp":786,"sure":787,"smc":788,"tun":789,"Ġen":790,"Ġclose":791,"Ġtipc":792,"anup":793,"Ġstate":794,"ify":795,"ĠAvoid":796,"irq":797,"rx":798,"sy":799,"tect":800,"Ġit":801,"Ġpa":802,"destroy":803,"Ġlength":804,"connect":805,"Ġreturn":806,"cre":807,"sit":808,"ta":809,"Ġem":810,"register":811,"Ġtun":812,"Ġpage":813,"ition":814,"Ġdev":815,"skb":816,"ĠPrevent":817,"Ġtrans":818,"lete":819,"19":820,"ET":821,"sc":822,"tra":823,"less":824,"Ġdou":825,"Ġus":826,"Ġmap":827,"dep":828,"ialize":829,"pace":830,"quest":831,"ween":832,"Ġbetween":833,"Ġoverflow":834,"Ġrecursion":835,"Ġdouble":836,"KD":837,"RE":838,"do":839,"ld":840,"packet":841,"qu":842,"ring":843,"user":844,"value":845,"write":846,"ĠM":847,"Ġfal":848,"Ġprevent":849,"Ġreject":850,"Ġnull":851,"Ġrc":852,"cpu":853,"Ġchecks":854,"ign":855,"Ġhandle":856,"ĠUse":857,"ialized":858,"Ġfalse":859,"ci":860,"list":861,"pp":862,"ub":863,"Ġsched":864,"Ġch":865,"Ġpre":866,"lab":867,"comp":868,"Ġhandler":869,"point":870,"Ġcleanup":871,"LOC":872,"check":873,"fin":874,"nc":875,"om":876,"ucma":877,"ĠH":878,"Ġinst":879,"Ġinter":880,"Ġinfo":881,"Ġpacket":882,"Ġund":883,"ces":884,"Ġwork":885,"ram":886,"ray":887,"rol":888,"Ġnon":889,"ily":890,"Ġhold":891,"Ġsockmap":892,"entry":893,"Ġaddress":894,"Ġhash":895,"Ġprotect":896,"Ġlist":897,"Ġannotate":898,"193":899,"Ġrcu":900,"EP":901,"fg":902,"fou":903,"ok":904,"tty":905,"leak":906,"ated":907,"atch":908,"art":909,"Ġonly":910,"imit":911,"Ġposit":912,"ĠAdd":913,"ĠCheck":914,"Ġheader":915,"Ġcomp":916,"Ġpolicy":917,"Ġpositive":918,"Re":919,"af":920,"fuse":921,"tx":922,"timer":923,"Ġsctp":924,"Ġcra":925,"Ġcorrect":926,"Ġtcp":927,"sta":928,"Ġmo":929,"Ġwa":930,"ipe":931,"Ġkcov":932,"ift":933,"ĠReject":934,"fault":935,"rpc":936,"1939":937,"Revert":938,"25":939,"bind":940,"dition":941,"hh":942,"sch":943,"tp":944,"Ġi":945,"Ġass":946,"Ġtime":947,"attr":948,"stop":949,"Ġregister":950,"Ġrequest":951,"dex":952,"device":953,"ange":954,"ill":955,"Ġstruct":956,"Ġlocking":957,"Ġunbound":958,"Ġproper":959,"rupt":960,"rtr":961,"ĠDon":962,"ight":963,"disc":964,"Ġensure":965,"CP":966,"mily":967,"ron":968,"sim":969,"ĠK":970,"Ġge":971,"Ġext":972,"Ġqueue":973,"ers":974,"Ġsan":975,"Ġslab":976,"Ġcount":977,"Ġper":978,"Ġreset":979,"Ġmake":980,"Ġvi":981,"Ġkey":982,"ifi":983,"Ġfamily":984,"Ġbug":985,"Ġuninitialized":986,"Ġrefcount":987,"Ġshift":988,"addr":989,"ĠGUE":990,"KDEP":991,"LOCKDEP":992,"Ġpositives":993,"Ġwait":994,"Ġunbounded":995,"AN":996,"cing":997,"pl":998,"size":999}