#version: 0.2 - Trained by `huggingface/tokenizers`
i n
r e
Ġ f
e r
e t
Ġ in
Ġ a
i x
o n
Ġ c
Ġ s
c k
o r
( )
l e
d e
i t
a t
l o
Ġ t
Ġ p
in g
a l
Ġf ix
h e
n et
s e
Ġ u
s t
c e
Ġ m
a n
o u
Ġ re
c t
Ġ b
e n
Ġ d
r o
Ġ w
t er
a d
Ġ F
lo ck
ĠF ix
s s
i on
r a
Ġ i
Ġ o
Ġ n
Ġ de
e d
Ġ h
a r
i d
o t
e m
n d
i l
re e
Ġf or
he ck
a k
u e
Ġt o
t r
i p
u r
at e
m a
i o
s c
Ġu se
Ġ on
e x
v e
Ġc heck
b le
Ġo f
Ġ v
f s
en t
e ct
Ġ R
d d
Ġp o
g e
n t
Ġ le
Ġ r
l l
Ġ k
u s
l i
f ter
o p
er r
Ġu n
i z
m p
ra ce
o ck
at ion
err or
Ġa dd
Ġm em
Ġ error
u p
al l
c o
Ġ lock
ur ing
s h
u t
f ree
or y
- >
s k
ou t
p f
de v
Ġle ak
t a
c h
u re
Ġ g
i al
u n
f o
an d
l in
he d
Ġu s
i m
Ġmem ory
s et
v er
it h
lo c
in it
Ġf a
l a
he n
Ġw hen
Ġa nd
Ġw ith
c p
l y
Ġa l
Ġt he
il ter
i a
c u
Ġp ro
lin k
Ġ race
b pf
8 0
i g
i le
Ġs ock
Ġde v
i f
Ġf ree
80 2
f ilter
v o
ou nd
ou nt
iz e
ma p
802 1
a ck
i s
al id
net filter
ex t
i ce
a fter
m o
Ġh and
q ue
re f
Ġs k
m ed
Ġ A
ro m
c ce
e l
Ġc o
Ġc on
a p
a m
o f
Ġc all
S A
p t
ip c
vo id
r m
Ġa n
sc hed
Ġ N
us b
i st
o l
A R
Ġb e
med ia
L L
Ġs t
v ent
8021 1
' t
W AR
Ġf rom
Ġa cce
lo w
WAR N
Ġa t
at a
A L
a ge
b u
g et
u ct
Ġ en
i c
j ect
o de
i r
Ġre mo
n el
Ġ x
Ġn ot
ĠR e
c on
Ġ U
Ġ q
or k
Ġhand l
m m
p o
p er
Ġ e
Ġa fter
at h
Ġi s
g ist
Ġ P
Ġre ad
V M
a sh
i sc
i ve
st r
ĠN U
AL SA
Ġus b
ĠNU LL
l u
n ect
p ro
u l
C U
b ound
v m
Ġ S
e e
r cu
net link
Ġb u
ĠR CU
co v
Ġdev ice
p a
Ġc a
Ġs tr
lo se
ta ble
l s
Ġi p
u m
u ll
Ġ D
Ġd o
am e
O C
b lock
c an
h t
in ter
it e
fo re
Ġbe fore
S B
a ble
f rm
Ġa void
Ġs et
Ġi o
ot h
ak e
n ce
t ipc
Ġ C
li st
que ue
l et
w a
re vent
er o
Ġd on
Ġd ata
Ġfa il
Ġacce ss
gist er
8 6
U SB
c ount
s it
u se
v al
Ġ j
Ġc le
al loc
Ġde ad
Ġde ref
Ġal loc
I N
t cp
z ero
bound s
Ġdead lock
b e
Ġ lo
it y
str uct
B lu
M A
m em
n l
o oth
r ou
et ooth
Ġin it
Ġc an
Ġp ot
ip v
ma c
Ġv alid
ent ial
Blu etooth
Ġpot ential
e re
n ot
p ut
Ġre f
Ġb y
li c
Ġsk b
K VM
n ing
Ġ net
re ct
re ss
ct p
Ġun init
Ġremo ve
D E
b ack
n ame
r ite
or t
Ġpo inter
bu f
ul t
c ur
Ġ "
Ġs h
Ġp ath
Ġhandl ing
d ing
Ġf al
Ġr t
Ġfal se
_ _
v alid
y s
Ġin f
Ġw ar
ar t
ver t
ere nce
i ble
m s
m it
s ure
t ls
w e
Ġ __
Ġf ile
er s
Ġwar ning
O N
c m
r p
r x
Ġ he
Ġ ex
re ad
Ġc lose
Ġt h
st ro
Ġm a
Ġn e
stro y
c i
e s
h h
r i
Ġ I
Ġ out
Ġ WARN
in t
Ġs e
Ġu p
Ġk cov
Ġsock et
Ġan not
ĠRe ject
OC K
1 9
g ing
s ock
u d
in d
re gister
on nect
Ġi f
Ġn f
Ġpo ss
Ġpo sit
ial iz
isc onnect
Ġposit ive
g s
Ġa s
Ġs c
de p
ss ing
im er
rou p
L OCK
f a
g roup
o re
x frm
de stroy
table s
Ġposs ible
p ort
w ork
Ġ T
Ġ list
er nel
Ġm ap
an up
ad d
DE P
19 3
Ġpositive s
LOCK DEP
D MA
c re
p ar
t h
an ity
Ġh ash
Ġcheck s
ack et
a se
y n
in fo
Ġin valid
Ġt r
ad v
193 9
I D
R DMA
c a
d s
e y
l k
n ode
t o
v l
Ġ it
le ss
de d
Ġp age
st op
an t
ad er
Ġn on
let e
Ġlo op
cur s
Ġannot ate
Ġsc hed
i b
m c
u b
Ġ -
Ġ G
Ġ M
Ġa r
Ġc h
Ġc or
Ġs anity
Ġp a
Ġd isconnect
Ġle n
un nel
Ġen sure
ĠU se
Ġip set
lic y
t y
w n
Ġs ize
sc h
Ġr cu
Ġk ernel
Ġg et
Ġco mp
f g
i ssing
m ent
p e
r c
s o
t ect
Ġs ta
Ġt ipc
Ġm issing
Ġre curs
Ġb it
Ġh ci
co mp
sk b
ig ht
que st
ĠA dd
Ġst ate
Ġq u
Ġcle anup
Ġderef erence
d u
i ct
l d
s ctp
Ġ zero
Ġin ter
ion s
em pt
im e
Ġsock map
ĠA void
Ġfail ure
Ġvalid ate
f d
p tr
at ed
ra m
Ġo p
Ġn ull
ol d
ĠP revent
ializ ed
f low
r up
Ġa re
Ġb et
Ġw ork
tr y
op y
cp u
if t
Ġcon t
ir q
po int
rp c
rup t
c heck
d o
f er
h ash
r tr
Ġ O
le ak
at ch
Ġp re
ou ble
Ġre t
Ġd ouble
Ġo ver
ur n
us er
dev ice
la b
Ġsh ift
Ġrecurs ion
H ID
f b
q u
s p
s er
s mc
it ion
Ġp revent
al t
Ġm ake
ou n
ct l
Ġd uring
Ġd is
ms g
R E
U E
b ind
r t
w it
Ġ E
Ġin st
at tr
Ġt a
al ue
ra ck
il y
Ġon ly
Ġv alue
Ġadd ress
ut ex
Ġal low
Ġpro tect
pro be
ĠD on
Ġref count
rx rpc
ant um
wit ch
2 5
g th
m ot
r y
in et
Ġc e
() :
en d
il l
Ġk vm
Ġlock ing
ial ize
of t
Ġhandl er
Ġstr uct
wa ys
we en
cre ate
Ġqu antum
Ġbet ween
Ġret urn
mot e
ry pt
a in
d p
d ition
o m
s ize
Ġin fo
le ase
an s
an ge
ro l
Ġw rite
ra struct
Ġpo licy
Ġlock dep
Ġg en
Ġhand le
Ġbu g
val ue
Ġinf rastruct
par se
Ġce ll
Ġinfrastruct ure
5 4
R e
a ud
l us
n s
p p
s im
x x
Ġ ext
re mote
Ġc ra
st a
Ġre ject
ge netlink
Ġlock less
Ġal ways
Ġat tr
Ġremo val
Ġq rtr
ee e
Ġcor rect
empt y
oft irq
Re vert
a s
c he
f ou
f ile
k cov
m ily
o k
s i
s se
s oftirq
u st
Ġ B
Ġ K
re d
et h
Ġt e
se nd
Ġm o
an ce
Ġre quest
Ġb pf
Ġd i
ra w
Ġh h
mp tcp
ation s
Ġerror s
Ġfa mily
8021 54
pa ce
Ġnet dev
Ġma c
Ġup d
yn c
Ġlen gth
Ġdis able
' s
A T
E T
a fs
m an
n on
o ol
t ing
w q
w rite
Ġ l
Ġ queue
Ġa d
Ġs p
at man
lo g
Ġt c
Ġp er
Ġm er
li mit
Ġun b
Ġus er
la y
ig n
Ġco re
ir t
Ġca se
wa it
Ġuninit ialized
we ight
hh f
Ġar ound
Ġbit map
Ġhh f
a ve
c ma
c nt
c fg
e ad
f in
r q
r on
s r
t p
v t
re c
Ġf b
Ġs ctp
Ġs lab
de x
de ref
Ġt unnel
se c
ce ss
ou s
ct ion
Ġb r
Ġr id
all back
Ġfa ult
Ġpro per
bu g
Ġx frm
Ġstr ict
ĠC heck
use d
Ġse q
lete ly
ĠG UE
Ġcomp letely
comp at
oun ded
rypt o
sse s
Ġunb ounded
C E
c lose
d rm
f use
i de
k ey
p acket
t x
Ġf la
et ht
Ġin et
Ġa ss
Ġc group
le n
de l
Ġt imer
he ader
Ġm ore
Ġi eee
Ġo per
ar d
ut e
init e
Ġpro be
ile d
Ġbu f
Ġca used
Ġalloc ation
Ġinf inite
Ġinst ead
aud io
lus h
Ġcra sh
sta ging
etht ool
0 0
R O
a f
a it
b atman
c le
c ing
d ata
d isc
i sh
m b
n e
Ġ ll
re am
Ġf s
Ġc re
Ġc ount
Ġs up
Ġt cp
Ġt ime
Ġp acket
Ġm ount
ou r
Ġi rq
Ġh old
id ge
ip e
co re
Ġfa iled
if y
Ġcon dition
Ġstr ing
IN G
Ġrt nl
ri ver
Ġpa ss
Ġover flow
6 4
b lk
c ap
d ma
h w
i re
m in
s g
t un
u count
Ġ V
Ġ ->
in dex
Ġf allback
on ding
Ġc opy
Ġu dp
Ġm e
Ġm utex
Ġre g
Ġb lk
Ġw ait
lock dep
Ġcheck ing
op s
all y
Ġus ing
Ġrace s
Ġco de
SA N
Ġst at
Ġacce sses
Ġen d
ee p
Ġcle ar
Ġinit ialize
Ġcan ce
Ġhe ader
Ġne w
ĠI P
fa ult
ĠT C
rc v
ser t
attr buf
Ġta sk
Ġgen er
Ġmer ging
ucount s
A D
b onding
f or
g h
g ain
h u
k vm
l b
m q
m ount
t unnel
v ing
x mit
Ġ empty
Ġf lush
er fs
Ġin ode
Ġa gain
Ġs rc
Ġs witch
Ġt able
Ġp ar
Ġre st
Ġb ound
ro p
Ġw h
Ġo ss
Ġto o
Ġpo ll
Ġk ey
Ġun register
ta sk
ig h
if i
is erfs
Ġcon nect
ĠRe ad
Ġq disc
po ll
Ġe le
Ġread s
pro c
Ġbu gs
Ġdevice s
node s
ib ute
Ġch ange
Ġop en
Ġte st
irt io
N O
O B
P O
T R
c la
c group
e c
g in
i ous
m d
v b
x sk
Ġ link
Ġ VM
re nt
Ġs y
or d
le d
Ġp art
Ġre gister
Ġd u
Ġn l
Ġde bug
con t
Ġnet ns
Ġrt netlink
Ġfile s
ON CE
Ġhe ld
Ġth is
fa ce
add r
Ġop s
Ġcont rol
Ġattr ibute
) _
A N
b d
c rypto
o ve
p r
r ation
s ub
v ide
w ar
Ġ ro
re lease
re iserfs
Ġf ib
Ġa f
Ġc al
Ġc fg
Ġs il
lo ad
Ġt y
Ġp cm
net rom
se nt
Ġu nd
Ġm ode
Ġb ad
en try
Ġd vb
ra cing
Ġi c
Ġo pt
io ctl
Ġv m
Ġr dma
op t
Ġleak s
Ġus age
ver y
cu l
Ġpro g
if name
pa g
Ġset ting
Ġdeadlock s
ress ion
ys fs
ca st
vl an
Ġinter rupt
Ġcont ext
Ġprotect ion
fin ish
Ġbr idge
Ġproper ly
Ġbuf fer
mb ol
Ġwh ile
Ġsy mbol
Ġsil ly
Ġund er
E R
a ch
b er
c s
c opy
f q
f ix
h old
l ing
o vl
p age
p ic
t imer
t ty
v s
Ġ '
Ġ em
Ġ eth
Ġf ull
Ġin t
Ġin vo
Ġa c
on e
Ġs er
Ġs ure
Ġs ile
Ġs end
or s
net dev
st ed
Ġre set
Ġre vert
Ġb c
Ġb ro
en ding
ra y
Ġh id
tr ans
ma ck
ex p
op en
mp le
mp it
un register
la ce
Ġwith out
Ġco mm
get lb
con nect
Ġe ar
Ġe vent
gist ration
pro cess
vm sg
ĠD o
Ġfail s
rou gh
Ġinit ializ
Ġref erence
Ġth rough
ĠWARN ING
ca che
Ġcor rupt
du le
Ġinter face
ĠO OB
Ġdi rect
Ġfla g
our ce
Ġoverflow s
Ġend point
D P
I T
L IN
R B
_ {
d i
e vent
f cnt
g er
h c
i es
i ally
k en
l an
m on
o g
s q
t ime
Ġ &
Ġ X
Ġ raw
Ġ limit
Ġ lay
in ode
re quest
Ġf i
et ect
Ġin put
Ġa b
Ġa ll
Ġs ub
de struct
it er
at ing
Ġt rack
Ġp e
Ġp ut
st at
Ġd ue
Ġd rop
lock ing
ss ue
Ġi g
Ġi ssue
Ġn o
Ġde let
em ove
ex it
ĠR E
ĠR emove
sh mem
ch ron
loc al
ia g
ĠU DP
po licy
Ġex it
ri v
Ġsocket s
Ġnf t
yn chron
rt imer
as an
Ġupd ate
cle ar
Ġtime out
Ġbound s
cla ss
Ġpart ially
Ġty pe
Ġbro ken
Ġinitializ ation
fcnt l
5 00
F S
I n
S I
S T
a x
b it
b tr
b fs
b ject
c b
g re
h sr
k e
l per
n o
p h
p ed
t race
u cma
v fs
Ġ 0
Ġ L
in sert
re ak
Ġf ilter
Ġin c
Ġc tx
Ġs q
or ation
at or
Ġt ree
Ġt race
Ġt un
net device
Ġre c
Ġre s
Ġre port
Ġre lease
ct x
en able
ss age
Ġi d
Ġn ame
Ġde l
Ġh ol
ar ge
ar gin
ot a
il d
ĠR T
nt rack
Ġr x
Ġr ight
Ġk free
iz ed
up d
out e
lin e
if ic
Ġsk ip
ĠA l
Ġcall s
Ġst ream
Ġen try
Ġx t
ĠU RB
po sure
Ġe very
Ġip v
Ġrt l
Ġex posure
Ġth at
Ġma x
Ġtr ans
Ġwork er
do wn
om ic
Ġfb con
Ġoper ation
hw sim
Ġreg ression
Ġgener al
Ġagain st
Ġrest oration
Ġeth nl
Ġsile nce
mple ment
In put
btr fs
1 2
8 1
: :
C M
E D
E N
F O
F P
N L
Q PO
S ET
T U
a re
d river
d iag
e ve
g p
g ic
k asan
l ving
m utex
n f
n bd
p re
p ath
p ipe
s ing
s ync
u x
u le
u ard
v c
Ġ z
Ġ netlink
Ġ IN
Ġ ord
Ġf ra
Ġin to
Ġc ls
Ġs nd
Ġs ch
Ġs pace
or rect
() .
lo op
Ġp r
Ġp ending
al k
al ance
se q
st ate
st art
ce ll
Ġm ult
an sit
Ġre p
Ġre str
Ġre gistration
Ġb lock
Ġb ack
Ġb og
Ġd river
ad get
Ġde fer
Ġh w
Ġh sr
ar k
ot p
ip so
sc r
sc si
Ġv b
Ġv ar
Ġk ill
Ġk eep
Ġun lock
Ġmem leak
Ġlock s
Ġg sp
un c
Ġus ers
Ġal so
Ġpro pag
Ġfree ing
ap i
Ġcall back
Ġacce pt
Ġat h
ĠP ut
ĠS QPO
Ġio ctl
wa re
Ġvalid ation
Ġhash table
Ġtr ansit
ĠM ake
ty pe
Ġpre sent
fb mem
Ġta g
Ġrefcount ing
Ġext ra
Ġcorrect ly
send msg
Ġmo dule
Ġrequest s
Ġupd ated
Ġsp l
ign al
Ġsup er
Ġsup port
Ġpacket s
Ġme ssage
hu getlb
Ġele m
cont rol
Ġcal cul
Ġic mp
Ġinvo lving
Ġbc sp
Ġcorrupt ion
LIN E
Ġlay er
destruct or
Ġhol ding
upd ate
Ġord er
Ġrestr ict
Ġbog us
Ġgsp ca
Ġusers pace
ĠSQPO LL
Ġtransit ion
A F
B U
C P
D I
I C
P RO
U N
a ct
a il
c y
d isconnect
f ig
g ram
h o
h y
h id
i se
o bject
p art
r ds
r oute
s mack
s ized
u cce
v irtio
w atch
Ġ 1
Ġ y
Ġ la
Ġ local
Ġ line
re q
Ġf un
Ġa x
Ġa ct
Ġa ut
Ġa rp
Ġa shmem
Ġs l
Ġs us
Ġs ysfs
Ġs ucce
lo b
Ġt ak
Ġt ty
Ġp ad
Ġp ipe
Ġfix ed
st ore
st ream
Ġm is
Ġm cast
ou ch
Ġd etect
lock s
ra p
Ġi mplement
Ġo ops
Ġn um
Ġh ave
ip t
Ġv irtio
Ġun ix
Ġadd ing
ta b
Ġg ue
un lock
fo wn
set up
Ġpro c
ext ra
Ġcon cur
Ġcon ntrack
Ġst art
Ġat omic
ĠU AF
per f
ĠP ro
Ġusb hid
pro g
ĠS M
Ġca che
um e
let ion
Ġj ust
Ġwarning s
Ġex ec
Ġne igh
Ġne sted
ri or
Ġas ix
th read
info leak
Ġcomp letion
Ġsta ck
Ġpre empt
oun ter
ĠE x
Ġvalue s
file s
write back
Ġtc f
rec vmsg
Ġass ume
Ġoper ations
Ġll sec
Ġcre ation
cap s
ĠV T
ĠTC A
ĠTC P
Ġopen vs
ĠVM X
Ġdebug fs
pr io
pic ious
Ġcomm it
Ġab out
stat s
ĠRE AD
ĠRT NL
ĠAl low
scr ipt
Ġpropag ate
PRO T
Ġsus picious
Ġopenvs witch
2 8
3 2
3 64
A SAN
I G
L A
L I
L O
L ite
O M
P F
U P
_ [
a c
a st
b alloc
c g
d c
d gram
f at
f ers
g fs
g ment
g uard
h d
h and
i e
k t
k ms
k ill
l ate
m i
n g
n al
n ore
o w
o ok
p kt
r ing
s up
s ist
u ed
u art
v r
v kms
w ire
y o
Ġ *
Ġ H
Ġ W
Ġ li
re s
Ġf in
Ġin sert
ix er
Ġc rypto
Ġs i
Ġs m
Ġs ource
Ġs ynchron
Ġs ignal
de lete
lo t
Ġt p
Ġt t
Ġt x
Ġt racing
Ġp ull
Ġp riv
al g
st em
Ġm eth
Ġm argin
Ġm balloc
Ġre q
Ġb ind
en ter
Ġd ma
Ġw ron
ss ion
ra ms
Ġi b
Ġn api
Ġde lay
ed ge
Ġh u
Ġh ook
ar y
ip hy
ve c
Ġof f
Ġv t
Ġr ing
Ġr io
ll c
li er
Ġun link
Ġadd r
co de
ure x
un ix
im um
ia ble
Ġpro ce
mo yo
que ued
med i
ĠA n
usb ip
Ġnot ific
Ġe b
Ġis otp
ĠS cell
pa re
Ġca ref
um ent
block ing
Ġset up
Ġcle an
alloc ate
Ġalloc ate
ipv s
Ġhe lper
Ġma gic
Ġse par
sock opt
ud p
work er
ĠT X
Ġtr ig
to moyo
vl v
Ġar g
Ġar ray
pe c
du ce
Ġzero copy
Ġwork queue
qu ir
bind er
Ġattr s
ĠK eep
ĠK ASAN
Ġmo ve
Ġdisable d
AT E
Ġad ded
Ġtc index
rec v
Ġtunnel s
Ġfla gs
ne w
ne igh
Ġll c
Ġirq s
min ix
Ġme sh
Ġcance l
Ġcance ll
fault fd
hu ge
ifi ed
Ġdu mpit
vide o
Ġopt ion
Ġear lier
Ġdirect ory
di sk
hc d
Ġinc orrect
Ġreport s
Ġfra gs
Ġhw sim
Ġvar iable
Ġspl at
Ġcalcul ation
Ġy urex
Ġpreempt ion
sup er
sist ent
wire guard
Ġmeth o
Ġwron g
Ġsepar ate
" ->
7 2
7 12
8 81
8 712
B SAN
E X
I OC
N E
N FS
a b
a ction
b y
b io
c li
c rypt
c ipso
d m
d ic
e vt
e poll
f y
f ra
f ork
f ram
g en
g em
g tp
h er
h rtimer
i rect
j ust
l p
l r
l or
m at
m ou
m atch
p u
p lic
q rtr
r ate
r un
s b
s n
s ion
s ig
s lab
s qu
s ysfs
t c
t e
t rack
t racing
t vlv
w ake
w ifi
y per
y stem
Ġ Q
Ġ MA
Ġ genetlink
in lock
re ce
re en
re set
re mo
Ġf q
Ġf low
Ġf use
er t
Ġc ss
Ġs it
Ġs el
le as
le ction
de bug
Ġt ake
Ġp id
Ġp ort
Ġp lace
al f
Ġm in
Ġm map
Ġm ixer
an g
Ġre leas
ct r
Ġb io
Ġb ase
Ġb reak
Ġd st
Ġw alk
Ġo om
Ġn ext
Ġn do
Ġde struct
Ġde lete
Ġh so
Ġh rtimer
Ġh alf
ar ing
em p
tr unc
ve l
Ġv er
ge red
Ġle ave
Ġr ds
Ġk cm
li fy
Ġun it
mp lify
dev link
ta prio
ch ange
Ġg so
Ġg adget
lin ux
is ize
is able
Ġcall ing
rm ware
Ġan oth
Ġst op
Ġst all
ĠRe vert
con n
con dition
VM X
ash fs
ĠS C
ht c
Ġio war
ĠC ON
IN D
IN FO
Ġlo ad
Ġlo ok
mem ory
Ġinit ialized
mac vlan
not ate
Ġpointer s
Ġhe ad
Ġth read
ĠI F
Ġup on
sock et
ud f
work queue
Ġmap ped
Ġit er
Ġsched ule
ĠG FP
Ġch ain
Ġcomp at
Ġqu ota
du mp
du mpit
point s
user faultfd
fb con
qu ire
RE SI
ĠB H
Ġmo d
Ġmac vlan
Ġad just
Ġsp inlock
Ġbuf fers
af e
Ġcre ate
Ġmount ing
AD D
Ġflush ing
Ġpar sing
Ġunregister ing
cont ext
pr int
sub mit
opt ions
Ġac count
Ġser ial
Ġhid dev
Ġear ly
Ġendpoint s
Ġfi el
Ġtrack er
Ġig nore
trace point
EN T
driver s
pre pare
Ġz r
Ġmodule s
Ġsuper block
BU G
ho st
smack fs
Ġaut o
lob al
Ġtak en
Ġnum ber
Ġconcur rent
Ġdelay ed
Ġproce ssing
ĠAn notate
Ġeb tables
Ġmagic mou
Ġarg ument
Ġcancell ation
cli ent
fram e
plic it
squ ashfs
track er
ĠMA C
rece ive
Ġflow table
Ġreleas ing
Ġanoth er
Ġiowar rior
ĠCON F
RESI Z
Ġmagicmou se
A r
F C
F ix
G A
G E
G M
G O
H A
I O
M U
O L
O R
P I
R M
R R
S E
S H
S ize
W OR
Y N
a v
a con
b l
b r
b id
b ase
b atch
c ss
c hed
d q
d st
d up
d ir
e p
e ys
e ach
e ger
f i
f am
f ill
g a
h ci
i v
i eee
i red
k ernel
k object
l ip
m e
m t
m id
n fs
n ly
n ext
n try
o wn
p i
p ing
p an
p en
p es
p riv
r g
r w
r ad
r tab
s he
s pace
s afe
s lip
t f
t u
t es
v ice
v sock
w mem
w ind
x dp
Ġ low
in k
in quir
re ed
Ġf ir
Ġf ds
Ġf ram
Ġf reed
er min
et s
Ġin con
Ġa ud
Ġa ction
on d
Ġc ur
Ġc set
Ġc ap
Ġc md
Ġc ounter
Ġc dc
Ġs b
Ġs mc
Ġs ync
or m
le x
le vel
it ors
at ive
Ġt w
Ġt im
Ġt ermin
Ġp ref
Ġp lu
Ġp vr
al low
al ign
Ġfix es
st map
ce l
ce usb
Ġm d
Ġm on
Ġm nt
Ġm atch
Ġm tu
Ġm ceusb
an o
Ġre d
Ġre fs
Ġre name
ct ls
ct ions
Ġb at
Ġb cm
Ġb ond
en sion
Ġd ang
ro se
ro id
Ġw usb
Ġw ake
Ġw lan
Ġw iphy
lock ed
lock less
ss f
Ġi h
Ġi ma
Ġn bd
Ġde stroy
Ġde fault
Ġde script
Ġde dic
Ġh yper
ar ds
em ent
Ġfor war
Ġto get
tr ust
tr ies
ma in
io d
sc reen
ex ec
Ġof fs
Ġv c
Ġv hci
Ġr ad
ll back
Ġk eys
us h
li b
li ce
Ġun trust
co m
co mm
Ġlock ed
Ġg ra
Ġg fs
Ġg pf
Ġg lobal
im ize
Ġfa stmap
Ġand roid
Ġpro cess
is ion
alid ate
ĠA ss
Ġcon st
Ġcon fig
ap p
ol ve
Ġbe h
Ġbe acon
bu ild
Ġen tries
ic s
ic ast
Ġx sk
ĠU BSAN
mm y
Ġe ach
Ġread ing
Ġusb ip
lu de
ul ation
ĠS et
Ġca if
Ġip ip
ull y
Ġdo es
can cel
inter rupt
ite ch
Ġio ctls
ĠC o
ĠC on
ĠC le
Ġaccess ing
mem cg
Ġvalid ity
Ġref cnt
Ġskb s
DE V
back log
buf f
Ġsh aring
valid ate
Ġex c
Ġne ed
ĠI D
ĠI n
Ġse lection
Ġannot ation
Ġas ync
fa il
Ġlist ify
add ress
cre ment
Ġtr y
adv ance
Ġpage s
ĠM ark
Ġch a
Ġch an
Ġpa ram
pe er
Ġsta le
Ġrecurs ive
Ġbit set
ld isc
check ed
hash limit
ĠO GM
ĠO nly
Ġpre c
Ġover sized
fb dev
qu ota
rt c
ĠE RR
Ġinst all
Ġprotect ed
Ġkvm alloc
Ġinfo leak
aud it
pp p
Ġcra she
ĠB PF
Ġdi vide
AT TR
Ġl on
Ġl arge
Ġper cpu
Ġper iod
Ġmer ge
Ġass ign
Ġass ert
cle anup
ĠV alidate
Ġcopy ing
Ġreg ul
Ġstat ement
ĠIP SET
Ġtask s
Ġele ment
PO L
Ġdu mmy
Ġnl msg
Ġfiles ystem
AN GE
Ġro se
Ġro ot
Ġcal led
pag ed
Ġ' _
Ġint eger
netdev sim
Ġhid raw
exp and
Ġdirect ions
ĠX Ar
Ġraw mid
Ġfi rmware
Ġpe ak
Ġig mp
Ġdelet ing
Ġrec ord
Ġrec vmsg
are r
nf c
ĠIN IT
Ġmult icast
Ġrep lace
LINE NO
CP U
Ġfun ctions
Ġsucce ssf
ĠPro tect
ĠSM C
Ġexec ve
ĠEx plicit
PROT O
mi ssion
ĠW rite
Ġli ve
Ġfin ish
Ġinsert ions
Ġsi mplify
Ġoff load
Ġcaref ul
Ġtrig gered
huge paged
Ġmetho ds
ab ling
lr u
debug fs
Ġnext h
emp late
trunc ate
Ġver ify
Ġfiel ds
ĠCONF IG
WOR K
br idge
fam ily
inquir y
Ġfir st
Ġfram es
Ġincon sistent
Ġaud it
Ġcur rent
Ġplu gin
Ġdang ling
Ġwusb core
Ġdedic ated
Ġforwar ding
Ġtoget her
Ġuntrust ed
Ġparam et
Ġcrashe s
ĠXAr ray
Ġrawmid i
ĠExplicit ly
* ()
0 6
1 1
7 8
= =
A G
A I
A M
C SAN
C LO
D C
F Q
F AI
G RO
G FP
H P
I P
K IND
L s
M P
N FC
P T
P TR
Q U
Q UE
R Q
R CU
S O
S ta
S mack
T Ls
V E
W A
W B
a ss
a ut
a med
a red
b s
b ro
b ar
b us
c op
c ounter
d b
d isable
e v
e le
f ere
f ind
f lush
f lex
g al
g ro
g ra
g up
g ative
h if
j o
k hugepaged
l c
l le
l ated
l arge
l wifi
m r
m u
m et
m lock
m ig
m map
m isc
m argin
m medi
n ull
n cy
o c
o s
o fs
o llback
p ad
p ia
p ending
r io
r si
s w
s al
s nd
s rcu
s pa
s um
s fq
s lot
t ree
t class
t ouch
t emplate
u al
u nt
u mp
v d
v ator
v host
w ith
w ext
w alk
w dm
x fs
y load
z e
} ()
Ġ J
Ġ or
Ġ ra
Ġ err
Ġ KVM
Ġ 500
Ġ ==
re ser
re size
re gistration
Ġf at
Ġf allocate
er y
et ach
Ġin dex
Ġa io
Ġa cp
Ġa pp
Ġa pi
on t
on ly
Ġc t
Ġc la
Ġc pia
Ġc sum
Ġs ing
Ġs lot
Ġs pec
() "
de fin
it or
it ed
it ialize
at ory
Ġt ra
Ġt ap
Ġt ouch
Ġp in
Ġp an
Ġp ur
Ġp ub
Ġp pp
Ġp neigh
Ġp ush
al ize
he ad
he lper
net em
se m
se linux
Ġu vc
Ġu rg
st im
ce ph
Ġm al
Ġm pt
Ġm cb
an ot
ou ld
ou gh
Ġre co
Ġre pa
Ġre work
Ġre cla
Ġre lated
Ġb us
Ġb dev
Ġb atman
Ġb alance
en ce
en ded
en cap
Ġd up
Ġd rm
Ġd isc
Ġd yn
ro duce
Ġw e
Ġw q
ter n
ad ing
ad cast
ĠF or
ss i
Ġi lle
Ġo vl
Ġo wn
Ġn fs
Ġn la
Ġn ode
Ġn VMX
Ġn amed
Ġde comp
Ġde ntry
Ġh ard
ar p
ar down
id le
ue vent
tr ig
ur ation
ma sk
Ġon e
Ġon ce
Ġv s
Ġv ia
Ġv irt
Ġv ide
Ġv lan
Ġv ga
Ġv iv
Ġv CPU
ĠR io
ĠR ollback
Ġpo lic
nt fs
nt ly
Ġr w
Ġr un
Ġr unt
Ġk a
Ġun bound
Ġun ified
iz ation
mp ro
race s
Ġmem ber
Ġmem policy
sh ow
ut down
Ġleak ing
ta il
ch an
ch ar
ch ain
Ġg race
Ġg tp
and le
im it
set s
ver sal
la st
link watch
Ġsock ptr
if e
ext ension
mo re
mo dule
ĠA cce
Ġco medi
Ġco lor
Ġcon so
am ic
ĠN HA
Ġbe ing
LL OC
low at
Ġen able
Ġen abling
Ġen ough
Ġremo ving
Ġx attr
Ġnot sent
ĠRe set
con f
con fig
ĠU SB
ĠU WB
po st
po inter
ĠP M
ĠP CM
ĠS OCK
pa ram
pa rams
Ġca ched
ĠD e
ĠD rop
ĠD etect
Ġdo wn
Ġdo main
OC OL
OC TLs
Ġio v
ĠC R
Ġfail ing
Ġj our
Ġj ited
Ġalloc ations
Ġalloc ating
Ġalloc ator
be arer
Ġlo g
mem policy
mem bar
not ify
Ġby tes
lic ate
Ġnet lb
Ġinf orm
Ġex p
Ġne gative
ri er
ĠI RQ
ĠI OCTLs
Ġse g
Ġse gment
Ġas ynchron
ĠT x
ĠT HP
cre ase
adv ise
Ġit s
Ġpage sets
ant s
ub i
ĠG RO
ĠM S
ĠM TU
ĠM POL
Ġch ild
Ġpa rent
Ġpa rams
Ġpa yload
Ġdisconnect ion
Ġsta b
comp lete
Ġinter nal
lab el
qu ired
RE D
RE Q
rt netlink
rt lwifi
Ġinst ance
end point
Ġstruct ure
Ġgen eve
lus ive
xx x
ĠK CSAN
red irect
Ġmac ro
AT OM
Ġl ate
Ġsp lice
Ġper net
sec comp
Ġfault y
Ġstrict er
packet s
len gth
del rec
ne sted
Ġll cp
Ġfs mount
Ġwait ing
Ġwait queue
Ġstat s
Ġstat ic
Ġgener ation
for m
for ce
Ġpar se
Ġpar ano
Ġrest ore
task s
NO FAI
TR A
md io
Ġlink watch
Ġdu mp
AN TU
war n
Ġopt ions
Ġopt imize
Ġinterrupt s
Ġunder flow
page s
Ġem atch
Ġem ulation
Ġfull y
Ġint roduce
Ġinvo ke
Ġac quire
Ġsend msg
exp mask
Ġcomm and
Ġevent s
ource s
mon itors
sq e
time out
Ġinput s
Ġab ort
Ġsub prog
Ġissue s
Ġno ise
Ġdelet ion
Ġdelet ed
Ġinc lude
Ġsq d
Ġsq o
Ġtrace points
Ġtun ing
Ġres ol
Ġres ources
Ġname s
Ġrx rpc
ĠURB s
Ġmax imum
Ġtrans port
Ġtrans fer
gp u
ĠIN ET
Ġspace s
Ġpr int
Ġmult ip
hugetlb fs
DI AG
Ġla st
Ġfun ction
Ġarp tables
Ġsl hc
Ġsucce ed
Ġpad ata
Ġpad ding
Ġdetect ed
Ġimplement ation
Ġgue st
ĠSM M
PROT OCOL
ac ity
hand le
Ġ* _
ĠH andle
res ult
res olve
Ġsm k
Ġsynchron ize
Ġsynchron ization
Ġhu getlb
Ġnotific ation
Ġnotific ations
Ġhelper s
881 72
fra g
gen eve
run ning
wake up
ĠQ P
remo ve
Ġmin imum
Ġunit s
Ġlook up
ĠIF LA
Ġmod probe
print k
Ġauto load
RESIZ EX
SH ED
dq buf
Ġcap acity
Ġtw ice
Ġpvr usb
Ġmnt get
Ġbat adv
Ġoffs ets
com ing
Ġconst ants
app end
ĠCon vert
Ġexc lusive
ĠIn itialize
Ġlon g
Ġregul atory
Ġnexth op
Ġplugin s
Ġparamet ers
GRO UP
QU ANTU
QUE UE
Sta ging
bro adcast
ev ict
gra de
jo in
mig rate
margin s
mmedi ate
spa wn
Ġra cy
Ġacp i
Ġsing le
defin ed
Ġpur ge
Ġuvc video
Ġmpt cp
Ġmcb a
anot ify
Ġreco very
Ġrecla im
Ġdup licate
Ġdyn amic
Ġille gal
Ġvirt ual
Ġvide o
Ġviv id
Ġrunt ime
Ġconso le
Ġjour nal
membar rier
Ġnetlb l
Ġinform ation
Ġasynchron ous
ATOM IC
Ġparano ia
NOFAI L
QUANTU M
1 0
1 6
1 00
2 0
3 8
5 0
7 0
8 19
9 0
A B
B R
C H
C I
C T
C ON
C RE
C OM
D G
E C
E E
E AT
E ST
E PROTO
E RED
F ree
F RE
F EAT
G S
I S
L E
L Y
M O
M ax
N U
P age
P acket
P ER
R P
R x
R FO
R ANGE
R AM
S P
S S
S TR
S ED
S ENT
S YN
S CON
T F
T O
T P
T S
T ER
U G
V L
W R
a le
a ce
a io
a cce
a ving
b h
b or
b dev
b cast
b reak
b alance
b vec
c all
c ls
c allback
d a
d r
d t
d at
d ist
d one
d etach
e o
e at
f il
f init
f ib
f pu
f anotify
g o
g or
g ed
g ress
g as
g adget
h ig
h ore
h ub
h locks
i ck
i or
i ed
i ma
i queue
i eve
i code
k l
k ed
k cm
l f
l er
l on
l ue
l fb
m k
m ad
m rp
m ant
m fd
m ust
m ark
m advise
n h
n i
n r
n x
n er
n sh
o S
o b
o st
o ss
o sk
o om
p c
p le
p id
p ack
p ol
p ee
p ull
p cpu
p one
p lace
p ie
p mu
q s
q fq
r b
r s
r dev
r map
r int
r ans
r ng
r ink
r ssi
s a
s f
s on
s ce
s ack
s ap
s lu
s fb
s ource
s ignal
s pec
t b
t g
t ion
t im
t mc
t ctx
t rap
t bl
u z
u led
u ards
v p
v ed
v irt
v cs
v gem
v ision
w er
w ap
w ant
w iphy
y ing
y nt
z alloc
Ġ #
Ġ (
Ġ /
Ġ 2
Ġ 9
Ġ |
Ġ et
Ġ let
Ġ ld
Ġ 64
Ġ 32
Ġ edge
in f
in st
in vo
in put
in valid
in sn
in coming
re al
re gist
re name
re port
re curs
re store
re ncy
Ġf d
Ġf w
Ġf ou
Ġf ill
Ġf ont
er net
er ic
er ialize
er form
et y
et ch
et urn
Ġin ex
Ġin line
Ġin sn
Ġin crement
Ġin ner
Ġa li
Ġa mp
Ġa rm
Ġa mount
Ġc c
Ġc y
Ġc lo
Ġc op
Ġc ir
Ġc lu
Ġc ake
Ġc ard
Ġc ipso
Ġc pu
Ġc ards
Ġc bs
Ġc lon
Ġs an
Ġs ig
Ġs is
Ġs ame
Ġs oft
Ġs om
Ġs af
ck et
or ing
or ter
or be
() '
() /
le ave
de c
de li
de script
it ize
it ions
it ting
at ors
at omic
at tern
lo ok
Ġt rap
Ġp tr
Ġp can
Ġp sock
Ġp crypt
Ġp attern
ing s
al cul
he st
net ns
se gs
se ssion
se lf
Ġu mem
Ġu md
Ġu lp
st v
st er
st ack
st ics
ce pt
Ġm et
Ġm an
Ġm ed
Ġm rp
Ġm bind
Ġm ust
Ġm sg
Ġm cs
Ġm ark
Ġm type
ou nce
ou ple
Ġre ce
Ġre la
Ġre du
Ġre check
Ġre size
Ġre ally
Ġre mount
Ġre iserfs
Ġre trans
Ġre submit
Ġre build
Ġre quired
ct or
Ġb ut
Ġb ig
Ġb low
Ġb vec
Ġb tf
Ġd p
Ġd s
Ġd if
Ġd iag
Ġd ying
ro om
ro pp
Ġw ill
Ġw ire
Ġw rap
Ġw dm
Ġw Max
ad ap
ad ow
ss can
ra in
ra ct
Ġi mb
Ġi mon
Ġi mpro
Ġi mmediate
Ġo ve
Ġo ld
Ġo vs
Ġo bject
Ġn d
Ġn s
Ġn at
Ġn ci
Ġn sim
Ġde ath
Ġde pen
Ġde finit
Ġh dp
Ġh tb
ar g
ar ch
ar ound
ar get
ar ded
id r
nd le
nd up
il fs
il la
Ġfor k
Ġfor mat
Ġfor bid
ue size
tr ieve
ip sec
ip mr
ur b
ur ious
ma x
ma y
io c
io l
sc an
sc pa
sc ri
Ġuse d
ex fat
Ġv ma
Ġv fs
Ġv ers
Ġv cs
Ġv sscan
fs gs
ĠR D
ĠR X
ĠR DMA
ĠR eturn
Ġpo ol
ge bl
nt ity
Ġle g
Ġle ading
Ġr c
Ġr oute
ll s
ll ap
ll ink
Ġk str
Ġk mem
Ġk asan
Ġk object
Ġk thread
Ġk zalloc
us ing
us age
li sh
Ġun ch
Ġun par
Ġun sub
Ġun locking
Ġun wind
Ġun checked
Ġun registration
Ġun defined
Ġmem control
co ok
co lor
sh are
ut ion
ut ed
ut es
ut ux
free ze
out q
Ġleak age
ch k
ch or
ch rdev
Ġg f
Ġg ro
Ġg ive
Ġg uard
Ġg lue
Ġg uards
Ġg scpa
un k
un link
un hash
un wind
set sockopt
init ialized
Ġfa sync
la pp
Ġal gor
ig et
ig mp
Ġsock hash
Ġsock addr
Ġdev m
if index
if ace
map ped
map ping
is m
is otp
mo de
ref cnt
ĠA PI
Ġco ver
Ġco llap
Ġcon d
Ġcon sistent
am rad
Ġcall ers
SA LLOC
pt race
Ġan y
Ġan chor
sched ule
ĠN e
ĠN ull
ĠN ET
ĠN LA
usb net
ist ics
Ġst ub
Ġat usb
bu st
get name
get sockopt
Ġen ter
ic ious
Ġnot ifi
ĠRe use
ĠRe port
ĠRe work
con d
con ntrack
Ġq fq
per ly
Ġe val
Ġe cache
ĠP F
ĠP erform
Ġusb fs
Ġusb lp
Ġusb touch
pro t
pro tect
vm x
vm ci
vm cs
ĠS G
ĠS anity
ĠS witch
ĠS ave
ĠS IOC
ĠS RCU
ĠS erialize
Ġbu cket
Ġbu ndle
Ġca using
Ġstr set
um em
ĠD irect
ĠD isable
Ġdo ing
block dev
ht b
inter face
Ġset sockopt
ĠC AN
ĠC orrect
ĠC LO
ĠC DC
queue s
wa s
ero fs
Ġdon e
Ġdata len
Ġj mp
Ġalloc ated
IN ET
IN LINE
IN TER
zero copy
Ġlo gic
MA P
MA X
nl dev
mac sec
ere d
put peer
Ġref use
Ġref act
Ġnet device
ress ors
DE LI
DE BUG
name space
buf fer
Ġsh mem
Ġsh key
Ġsh mlock
Ġsh ould
Ġsh utdown
Ġsh adow
Ġpath s
ers pan
cm d
rx e
Ġma y
Ġne ver
Ġne cess
int s
Ġse cond
Ġup per
Ġannot ations
sock fd
Ġnf netlink
Ġposs ib
gs o
Ġas oc
Ġsc si
fa st
port s
ĠT rans
Ġlist ified
Ġmap ping
cre ated
par m
Ġtr c
Ġtr im
ID I
ID IOC
Ġit em
Ġnon blocking
Ġsched uled
ib utes
ĠG PF
ĠG SO
ĠM ove
ĠM MU
ĠM PT
ĠM IDI
Ġpa ssing
ty pes
Ġsize s
Ġrcu idle
Ġget ting
Ġcleanup s
Ġinter val
Ġfailure s
Ġbet ter
Ġbet op
irq son
do i
ĠO pen
ĠO DEBUG
leak s
Ġpre mat
Ġret ake
Ġover write
Ġover lapp
qu ery
sp rint
ser ver
ser vice
Ġdis allow
Ġdis mant
ĠE X
ĠE ST
ĠE GA
attr s
Ġallow ed
ĠDon t
Ġreturn s
Ġreturn ed
Ġwrite s
Ġpolicy db
Ġgen hd
as ix
che s
file map
ok e
si w
sse d
ĠB reak
ĠB IO
ĠB TF
ĠB UG
Ġte am
Ġte ardown
Ġdi sk
Ġupd ating
Ġqueue s
Ġqueue ing
Ġad v
Ġad utux
Ġsp urious
Ġcase s
wait q
ron t
deref erence
ide ntity
key code
Ġass ump
RO Y
Ġfs ync
Ġcre ated
Ġcount ing
hw rng
min or
ĠV GA
ĠV IDIOC
Ġblk dev
Ġstat us
Ġstat istics
Ġclear ing
Ġclear ance
Ġcance ling
ĠIP V
ĠIP v
rcv buf
Ġgener ated
Ġinode s
Ġtable dist
Ġrest art
Ġbound ary
Ġconnect ion
Ġconnect ions
Ġqdisc s
Ġele vator
Ġchange s
Ġopen ing
NO RM
NO WA
ec ute
ĠVM A
Ġdebug ging
sub class
Ġro bust
Ġty pes
Ġmode l
Ġic sk
Ġic log
Ġvm x
cul ar
fq s
fix ed
tty printk
Ġint el
Ġac quir
Ġser ialize
Ġser vice
Ġsile ntly
Ġreference s
Ġcorrupt ed
LIN K
di rect
ger able
mon o
og itech
sq o
Ġlay ers
Ġsub list
Ġsub flow
Ġsub mission
Ġtrack ing
Ġpe ers
Ġpe gas
stat us
ĠRE Q
bit s
bit map
ke ys
no stics
ph ic
ĠL imit
ĠL ogitech
Ġres ult
enable d
Ġid r
Ġrx e
ĠAl ways
Ġxt s
Ġmax packet
CM D
are a
nf t
path s
path tbl
Ġfra gment
Ġpr ism
cell s
Ġrep orter
Ġdriver s
Ġdefer red
Ġvar ious
Ġkill ing
Ġaccept ed
Ġtag set
Ġspl itting
Ġcalcul ate
BU FS
DI SCON
DI SALLOC
part ial
part ition
Ġ1 6
Ġla ck
Ġla pic
Ġact ive
Ġaut h
Ġsl ip
Ġsl can
Ġtak ing
Ġmis use
Ġmis match
Ġimplement ations
Ġconcur rency
Ġstart up
ĠPro perly
Ġcache s
Ġneigh bor
ĠEx ecute
LI ST
LI SHED
hd r
hd lc
hand ler
Ġli ke
Ġinsert ion
Ġsm all
Ġtt usb
edge port
Ġhu ge
Ġcaref ully
Ġclean ly
Ġtrig ger
Ġmetho d
72 0
NE W
NE CT
cipso v
fra gs
gen eric
sb and
tc index
te k
te am
ĠQ oS
remo val
ctr l
ctr ls
Ġbase d
Ġbreak age
Ġdestruct ion
Ġleave s
Ġunit ialized
VMX E
ĠSC SI
ĠSC TP
ĠIF F
Ġiter ators
ADD RFO
Ġaccount ing
ENT ERED
RESIZ E
av ail
av ior
dir ty
mt d
nfs d
own er
Ġtim ers
Ġtermin ation
Ġpref ix
Ġpref etch
align ed
align ment
Ġmon itor
Ġmatch ing
Ġwake up
Ġdescript or
Ġdescript ors
Ġhyper v
exec uted
Ġrad ix
Ġrad io
comm on
Ġgra b
Ġgra phic
ĠAss ure
ĠAss ign
Ġconfig uration
Ġbeh ave
Ġbeh avior
ĠCo ver
ĠCle ar
ĠCle anup
Ġneed s
ĠID R
fail ure
Ġcha osk
Ġcha ract
Ġchan nel
Ġchan ging
Ġprec ision
Ġprec alcul
Ġassert ion
Ġigmp v
Ġsuccessf ul
Ġsuccessf ully
Ġlive locks
CLO SED
IP v
ele m
fere nt
flex cop
met a
walk er
ĠJ IT
reser ve
Ġfat al
Ġcla sses
Ġslot s
Ġspec ific
Ġtra versal
Ġtap rio
Ġpan ic
Ġpub lic
stim ation
Ġmal icious
Ġrepa ir
Ġdisc arded
Ġwq e
ĠFor bid
Ġown er
Ġdecomp ressors
trig gerable
Ġpolic ies
Ġka sprint
char dev
ĠAcce ss
Ġlog itech
Ġexp ression
Ġseg fault
TRA CE
Ġprint ing
Ġmultip le
819 2
AB LISHED
BR ADD
CH ANGE
CRE ATE
COM P
DG RAM
FRE E
Packet Size
SYN C
eo d
eat ure
hig hest
nx t
pee k
slu b
spec ial
tim ers
uz z
ynt h
Ġet f
Ġld usb
invo ke
Ġinex act
Ġali en
Ġclo sing
Ġcop ies
Ġcir cular
Ġsis usb
Ġsom e
Ġsaf ety
deli ver
look up
Ġmed ia
Ġrela x
Ġredu cing
Ġresize s
Ġremount ing
Ġresubmit ting
Ġblow n
Ġdif ferent
Ġdiag nostics
ropp ed
Ġwire less
Ġwrap per
ĠwMax PacketSize
adap ter
Ġimb alance
Ġimpro per
Ġdefinit ion
Ġhdp vr
illa ble
scri be
Ġvers ion
Ġvsscan f
fsgs base
gebl it
Ġkstr ndup
Ġkmem leak
Ġunch arge
Ġunsub scribe
Ġalgor ith
amrad io
ĠNET DEV
Ġnotifi er
ĠReport Size
Ġeval u
Ġusbtouch screen
ĠSIOC BRADD
ĠCorrect ly
ĠCLO SE
Ġrefact oring
DELI F
Ġnecess ary
Ġpossib ly
ĠMPT CP
Ġpremat ure
Ġoverlapp ing
Ġdismant le
ĠEST ABLISHED
Ġassump tion
NORM AL
NOWA IT
Ġacquir ing
Ġpegas us
DISCON NECT
DISALLOC ATE
ADDRFO RM
Ġchaosk ey
Ġprecalcul ate
Ġkasprint f
" "
' ve
( !
) ->
0 2
0 8
1 4
1 78
2 4
2 00
3 0
3 3
3 5
4 5
4 70
5 2
5 9
5 100
5 33
6 81
6 50
6 02
7 5
7 9
7 00
9 1
9 80
9 00
9 06
A P
A S
A X
A b
A PI
A SE
B A
B D
B Q
B AL
B LOCK
B IND
B LE
B BA
C K
C N
C O
C ING
C DC
C VE
C BQ
D B
D N
D ON
D AT
D ING
D YN
E B
E M
E W
E Y
E IN
E MA
E AD
E MU
E PER
F I
F R
F T
F ER
F EN
F ence
F TRACE
G L
G RE
G ET
G IC
G ATE
G INFO
H O
H R
H ER
H CP
H TO
I X
I LL
I AL
I MA
I CE
I VE
I BLE
J FS
K S
K OB
K EY
K ILL
L B
L D
L P
L S
L OC
L AT
L ET
M M
M ake
M SAN
M TU
M EMA
M HO
N G
N CM
N ENT
N MAP
N IX
O I
O W
O LL
O KS
P U
P AL
P RE
P EN
P EE
P LY
R C
R H
R UN
R UP
R ATE
S D
S G
S V
S UN
T A
T Y
T PO
T ail
T HTO
T IBLE
U se
U AR
U probe
U RB
U BSAN
U LP
V S
V ID
V ER
W rite
Y a
Y ED
[ ]
] :
_ *
_ ]
a set
a ir
a cm
a es
a ded
a ead
a ger
a ild
a ux
a com
a head
b c
b o
b p
b ing
b ed
b ot
b ers
b to
b our
b lob
b tab
b print
b tf
b os
b inf
b ounce
b lish
c c
c d
c q
c r
c at
c al
c ip
c sk
c cp
c map
c ake
c lic
c lk
c atch
c dc
c lr
c lude
c rtc
c ouple
d f
d l
d n
d is
d pa
d yn
d attr
d raw
d rop
d vb
d rain
d ropped
e k
e w
e val
e fi
e stim
e gress
f e
f f
f t
f w
f lo
f ro
f fs
f rom
f lu
f ull
f put
f utex
f allback
f led
f load
f cs
f ies
f unc
f req
f comm
f ont
f ence
f ront
f eature
f uzz
g y
g lock
g ue
g pt
g pa
g ht
g rp
g to
g end
g nore
g lobal
g mt
g arp
h v
h fs
h mac
h ys
h ange
h ard
h amradio
i ss
i ot
i sk
i ch
i cp
i que
i el
i antum
i mplement
i mplify
j or
j fs
j if
j ffs
k er
k ref
k ee
k probe
k eep
k cs
k time
k no
k dir
k build
k fence
l m
l n
l t
l it
l ci
l one
l stats
m l
m er
m ss
m ma
m nt
m ake
m ld
m release
m ixer
m wifi
n y
n ss
n ed
n dev
n is
n of
n ee
n um
n sure
n cm
n cing
n api
n by
n orm
n vd
n ilfs
o le
o ot
o mp
o ver
o bind
o cb
o ost
p b
p q
p et
p net
p se
p io
p ver
p ly
p ref
p lu
p ul
p cm
p ri
p sock
p lay
p rec
p lan
p store
p rior
p orbe
q disc
q mi
r f
r h
r r
r it
r isc
r vl
r ange
r dt
s z
s in
s ix
s an
s mp
s un
s ive
s ys
s anity
s witch
s ign
s igh
s ystem
s me
s mk
s vp
s bitmap
s ynth
t t
t v
t ot
t mp
t out
t ure
t set
t filter
t ext
t mem
t empt
t urn
t end
t ick
t arget
u i
u ce
u an
u ss
u la
u vc
v x
v ar
v id
v ma
v able
v addr
v ail
v ga
w b
w m
w w
w in
w he
w ma
w free
w ard
w mi
x l
x stats
x pan
x attrs
y le
y sc
z d
z r
z en
z able
} _
Ġ !
Ġ +
Ġ .
Ġ 6
Ġ <
Ġ @
Ġ _
Ġ ion
Ġ ent
Ġ loc
Ġ OC
Ġ 86
Ġ ram
Ġ racing
Ġ rap
Ġ queued
Ġ ldisc
Ġ label
in er
in al
in ed
in ue
in ation
in el
in str
in val
in sp
in validate
in clude
re g
re sh
re ver
re sched
re use
re alloc
re vert
re sp
re sses
re mount
re duce
re config
re label
re quired
re balance
re place
re trieve
re mono
re stimation
re aded
re implement
re ply
re turn
Ġf f
Ġf l
Ġf an
Ġf sc
Ġf ound
Ġf get
Ġf ind
Ġf ool
Ġf ops
Ġf pu
Ġf db
Ġf anotify
Ġf ront
Ġf eature
Ġf uzz
Ġf ew
er n
et ic
et hh
Ġin j
Ġin ject
Ġin str
Ġin struct
Ġin act
Ġin crease
Ġin complete
Ġin coming
Ġa a
Ġa u
Ġa z
Ġa ck
Ġa tr
Ġa fs
Ġa bu
Ġa wa
Ġa es
Ġa pic
Ġa ware
Ġa vail
on y
on et
on or
on al
on ic
Ġc m
Ġc lock
Ġc mp
Ġc red
Ġc ops
Ġc api
Ġc rtc
Ġc lc
Ġc ouple
Ġc iner
Ġs r
Ġs le
Ġs en
Ġs id
Ġs em
Ġs ent
Ġs nt
Ġs mp
Ġs un
Ġs la
Ġs ms
Ġs par
Ġs pe
Ġs oftirq
Ġs mack
Ġs ized
Ġs alg
Ġs afe
Ġs aving
Ġs wap
Ġs ony
ck ets
or c
or ce
or ds
or ies
or ary
or mat
le l
le ar
le ctr
le ading
le ctor
de sc
de init
de fault
de allocate
de ntry
de crement
de ncy
de registration
de sce
de llink
it v
it ter
at en
at ta
at ches
lo ver
lo ader
lo om
Ġt k
Ġt sk
Ġt hen
Ġt info
Ġt so
Ġt ight
Ġt dp
Ġt file
Ġt packet
Ġt one
Ġt vlv
Ġt emp
Ġt emplate
Ġt ick
Ġt arget
Ġt ioc
Ġt icp
Ġp d
Ġp f
Ġp g
Ġp n
Ġp ll
Ġp ul
Ġp ress
Ġp ers
Ġp lus
Ġp key
Ġp md
Ġp trace
Ġp vc
Ġp hy
Ġp store
Ġp rior
Ġp hys
al b
al er
al ig
al ist
al ive
al th
al ized
al lel
he ld
se d
se g
se map
se cur
se cre
se ction
se gment
se lection
se ctor
se ek
Ġu ss
Ġu probe
Ġu cma
Ġu dma
Ġu mount
Ġu event
Ġu ie
Ġu ring
Ġu mad
Ġu rb
Ġu df
st d
st e
st i
st s
st or
st ing
st and
st ers
st pone
st yle
st ined
ce str
ce add
ce ssed
Ġm c
Ġm l
Ġm mp
Ġm ig
Ġm ic
Ġm ld
Ġm pp
Ġm si
Ġm pi
Ġm mu
Ġm advise
Ġm pol
Ġm ft
Ġm gmt
Ġm kdir
Ġm ula
Ġm xl
Ġm atches
an y
an on
an ch
Ġre gist
Ġre alloc
Ġre cur
Ġre try
Ġre bind
Ġre mote
Ġre duce
Ġre quire
Ġre expand
Ġre versal
Ġre config
Ġre trieve
Ġre schedule
ct info
Ġb h
Ġb ot
Ġb and
Ġb oth
Ġb ool
Ġb sg
Ġb onding
Ġb di
Ġb locking
Ġb ail
Ġb ounce
Ġb oost
Ġb pq
Ġb loom
en er
en queue
en ds
en crypt
en ale
en sive
Ġd a
Ġd ate
Ġd io
Ġd ock
Ġd ig
Ġd ir
Ġd be
Ġd ax
Ġd vd
Ġd etach
Ġd lfb
Ġd rb
Ġd rain
Ġd ropped
Ġd ccp
Ġd ln
Ġd tv
ro ot
ro ll
ro be
ro llback
ro tek
Ġw id
Ġw ind
Ġw atch
Ġw rt
Ġw as
Ġw acom
Ġw rit
ter min
ad ata
ĠF R
ĠF ree
ĠF AT
ĠF ast
ĠF DB
ĠFix up
ra ion
ra ctx
ra ints
ra remono
Ġi op
Ġi attrs
Ġo dd
Ġo mit
Ġo th
Ġo ob
Ġo cc
Ġn i
Ġn r
Ġn link
Ġn if
Ġn lk
Ġn ative
Ġn ilfs
Ġde queue
Ġde caps
Ġde code
Ġde crement
Ġde fere
Ġde grade
Ġde regist
Ġde llink
Ġde frags
Ġde couple
Ġde ny
Ġde prec
Ġde stined
ed uce
Ġh i
Ġh fs
Ġh if
Ġh is
Ġh table
Ġh list
Ġh fa
Ġh tab
Ġh tc
Ġh ang
Ġh aving
Ġh da
Ġh dr
Ġh ints
Ġh amradio
Ġh fcs
Ġh pet
Ġh onor
ar m
ar se
ar gs
ar min
ar ray
id s
ot ow
nd o
nd ant
il a
il er
il ic
il ity
il ding
ree xpan
Ġfor ceadd
ip s
ip ip
ip lin
ip tunnel
ur ning
ur bs
ate ch
ma buf
io v
io map
io per
io stat
io bus
sc q
sc aler
Ġuse less
ex ist
ex cept
ve cs
ble ms
Ġv p
Ġv q
Ġv free
Ġv is
Ġv ht
Ġv mem
Ġv sock
Ġv port
Ġv ie
Ġv gem
Ġv icode
Ġv iol
Ġv dpa
fs id
fs ync
fs notify
fs aild
ect ed
ĠR ET
ĠR FC
ĠR NG
ĠR educe
dd y
Ġpo is
Ġpo lice
Ġpo wer
Ġpo pul
Ġpo stpone
ge sts
Ġle d
Ġle ss
Ġle ast
Ġr m
Ġr p
Ġr and
Ġr hash
Ġr ange
Ġr si
Ġr ule
Ġr ise
Ġr ssi
Ġr pc
Ġr fcomm
Ġr grp
Ġr svp
ll seek
Ġk time
Ġk vc
Ġk worker
Ġk fi
Ġk memcg
Ġk hugepaged
Ġk illable
Ġk btab
Ġk ern
li min
li ber
li bfs
li ght
op e
op ul
Ġun ion
Ġun co
Ġun un
Ġun set
Ġun map
Ġun mo
Ġun pro
Ġun int
Ġun less
Ġun hash
Ġun bind
Ġun used
Ġun sent
Ġun exp
Ġun condition
Ġun safe
Ġun icode
Ġun share
Ġun freeze
Ġun aligned
Ġun kno
Ġun win
Ġun termin
mp i
mp lete
ock map
error s
Ġadd ition
Ġadd resses
Ġmem s
Ġmem set
Ġmem cp
Ġmem cg
Ġmem dup
Ġmem sw
Ġmem slot
Ġmem bers
up port
up ied
up robe
co l
co w
co ded
co del
co mb
co arse
uring s
sh ip
sh ake
sh ift
sh ared
sh ould
sh utdown
sh rink
ut ions
sk ip
sk msg
sk buff
out s
out put
out stand
dev ids
Ġleak ed
ta s
ta in
ta ck
ta gs
ch ing
ch ip
ch unk
ch oke
ch nis
Ġg c
Ġg re
Ġg ot
Ġg em
Ġg ig
Ġg rp
Ġg roup
Ġg arp
Ġg pio
Ġg armin
un init
un bind
un conf
un defined
un share
un ique
fo ld
and s
and ard
im m
im ing
init ialize
Ġfa stop
la cing
la pic
la pb
Ġwith in
cp us
cp ath
Ġal tset
Ġthe m
Ġthe ir
Ġpro cce
Ġpro of
Ġpro gs
Ġpro to
Ġpro mote
Ġpro vide
Ġpro di
Ġpro duce
Ġpro blems
link xstats
80 1
ig inal
Ġdev link
Ġdev map
Ġdev key
if c
Ġfree ze
Ġfree zable
vo lu
ack s
is hed
is ofs
is dn
is play
ext s
ext ent
ext ended
mo ve
Ġhand shake
ref resh
Ġsk cip
ĠA F
ĠA P
ĠA SA
ĠA pp
ĠA MP
ĠA RP
ĠA BBA
el d
el f
Ġco ok
Ġco ale
Ġco mma
Ġcon n
Ġcon vert
Ġcon tain
ap ped
ap hore
ap parm
of da
of fload
SA CK
pt imize
rm dir
Ġan sw
Ġan cestr
ĠN F
ĠN API
ĠN BD
ĠN EW
usb in
usb lp
usb tmc
ist ing
ol ating
AR E
AR GS
Ġbe arer
Ġst d
Ġst ill
Ġst ep
Ġst omp
Ġst andard
Ġat i
Ġat m
Ġat tempt
bu lk
bu ckets
get blk
get unique
Ġen crypt
Ġen force
ic al
ject ion
ir y
ir med
Ġx a
Ġx mit
Ġx array
Ġx fsaild
Ġnot ation
Ġnot ify
ĠRe gister
ĠRe place
con vert
ĠU NIX
Ġq p
ork around
Ġhandl ers
mm u
mm io
po six
po wm
per net
per cpu
Ġe a
Ġe p
Ġe sta
Ġe sn
Ġe gress
Ġe stimation
Ġe wma
Ġe limin
Ġe jection
Ġis n
Ġis ofs
Ġis olating
ĠP I
ĠP T
ĠP V
ĠP MU
ĠP ush
ĠP ass
ĠP ost
ĠP TRACE
ĠP EB
ĠP OLL
Ġread ahead
VM CI
ive ly
str ing
str par
ĠNU D
Ġusb core
Ġusb mon
Ġusb tmc
Ġusb vision
pro to
pro fil
ul er
vm w
vm on
vm delete
ĠS P
ĠS ync
ĠS IT
ĠS ynchron
ĠS IG
ĠS PI
ĠS YN
ĠS wap
ĠS ynth
ĠS TA
ĠS implify
ĠS ockmap
ĠS upport
Ġbu ild
Ġbu ilding
Ġbu ddy
pa e
pa ss
pa red
pa ste
Ġca ching
Ġip sec
Ġip mr
ĠD RE
ĠD IO
ĠD EST
ĠD SS
ĠD SYNC
ĠD EAD
ĠD HCP
ĠD OI
block s
inter val
Ġset attr
Ġset time
Ġio map
Ġio wq
Ġio vecs
ĠC all
ĠC lose
ĠC opy
ĠC ASE
ĠC OW
ĠC PU
ĠC SD
ĠC hange
list s
list en
let ouch
Ġdon t
count ing
use c
Ġj ump
Ġj acks
Ġcle ared
Ġderef ence
MA NENT
mem less
mem ber
Ġinit ed
Ġinit ial
Ġinit alize
Ġinit call
Ġcan onic
Ġvalid ated
Ġvalid ator
Ġref er
Ġby dst
Ġby pass
lic ing
lic ations
Ġskb cnt
Ġskb prio
Ġnet em
Ġuninit alized
DE ST
DE LA
back s
back ing
back end
name i
name s
buf fs
buf fers
cur r
cur ate
cur rent
Ġsh ort
Ġsh ared
Ġsh rink
Ġrt x
valid ity
Ġinf ormat
Ġwar n
ms rs
Ġfile name
ON LY
cm rvl
rx ep
Ġhe ight
Ġhe alth
Ġex port
Ġex cess
Ġex fat
Ġex plicit
Ġex tern
Ġex cept
Ġex tack
Ġex isting
read er
read pipe
Ġth p
Ġth an
Ġth readed
Ġma in
Ġma sk
Ġma ster
Ġma jor
Ġne sting
es pec
ĠI mplement
ĠI CM
ĠI mpro
ĠI mmediate
ĠI gnore
Ġout go
ĠWARN ings
Ġse cle
Ġse arch
Ġse lector
Ġse cpath
Ġannot e
sock addr
ud o
ud lfb
ud mabuf
register s
Ġif e
Ġif types
Ġif orce
Ġnf tables
Ġnf cmrvl
Ġas m
Ġsc reen
Ġsc rollback
Ġsc ope
dep opul
fa ir
fa iled
group s
ore d
work s
ĠT UN
ĠT IOC
ĠT VL
ĠT SYNC
ĠT AS
ĠT LB
ĠT TY
Ġlist ener
add ref
193 5
193 32
cre d
cre ation
par ms
th p
th is
Ġchecks um
Ġtr ue
Ġtr unc
Ġtr uesize
ca if
ds mark
to m
to do
Ġit ers
Ġpage block
Ġpage cache
Ġloop ed
curs or
Ġsched uler
ĠG adget
ĠG RH
ĠM ore
ĠM RE
ĠM bp
Ġar ches
Ġch addr
Ġch oke
Ġpa use
Ġdisconnect ed
wn grade
Ġget s
Ġget name
Ġget opt
Ġcomp lex
pe p
Ġbit s
comp ress
comp action
comp iler
skb prio
Ġqu ery
Ġqu atech
ld ir
Ġinter pre
fd ata
fd info
ptr uesize
Ġop ipe
flow er
flow label
Ġwork ers
Ġwork around
cpu freq
Ġcont inue
Ġcont roll
do it
do main
do orbe
ĠO SS
ĠO RC
ĠO ptimize
Ġpre req
Ġpre pare
Ġpre dic
Ġpre scaler
Ġret urning
Ġover size
user data
user copy
user policy
Ġshift s
sp i
sp dattr
sp lit
ser ial
Ġmake s
Ġdis abling
RE AD
RE MO
RE PLY
RE TPO
ĠE P
ĠE CN
ĠE FI
ĠE THTO
ĠE nsure
ĠE rr
ĠE lectr
attr ibute
Ġta gs
Ġallow ing
Ġrefcount s
25 00
inet peer
Ġce ph
dition ally
rol lover
Ġwrite pages
Ġwrite backs
Ġgen l
Ġcell s
ns id
pp y
xx u
Ġext ension
Ġext ended
sta mp
Ġattr ibutes
ok s
si de
si mple
ĠB ail
ĠB IND
ĠB ADD
ĠK ernel
ĠK EE
ĠK FEN
ĠK MSAN
ĠK UBSAN
eth er
eth ernet
Ġte aring
Ġte chnis
send stream
Ġmo ving
ance stor
Ġdi Free
Ġdi vision
Ġdi gests
Ġmac sec
Ġlength s
ET HER
Ġl to
Ġl addr
Ġl tout
Ġad mission
Ġad iantum
Ġad vmon
Ġsp licing
Ġper m
Ġper mit
limit s
limit ed
Ġunb alance
Ġuser faultfd
Ġcase fold
fin e
fin al
fin alize
sr h
vt i
rec ord
Ġfb dev
Ġfb cmap
sec ure
ous bto
Ġbr ing
Ġbr nf
Ġxfrm i
tx hash
tx timer
Ġoper ands
RO PT
data gram
ne ss
Ġfs id
Ġcre ds
Ġcre ating
Ġmount s
Ġhold outs
Ġcondition al
Ġpass ive
blk dev
blk trans
blk trace
blk cg
cap i
Ġme ss
Ġreg map
Ġreg domain
Ġblk g
Ġblk sz
Ġend less
Ġcance led
Ġnew ly
Ġnew link
ĠIP I
ĠIP PROTO
ĠTC F
Ġgener ate
for med
for ward
mount point
Ġswitch ing
Ġpar k
Ġpar ser
Ġpar allel
Ġwh ich
Ġwh ole
Ġpoll ing
Ġkey ing
Ġkey ring
Ġkey code
Ġkey bo
task stats
ifi es
Ġconnect or
Ġconnect ing
Ġconnect ed
Ġopen er
Ġtest ing
NO T
NO FS
OB AL
md sc
xsk map
Ġsy stem
led isplay
Ġpart ial
Ġpart itions
Ġregister ing
addr conf
AN CING
sub script
sub system
Ġro le
Ġro bot
Ġbad ness
Ġdvb dev
Ġvm k
Ġvm w
Ġvm alloc
Ġvm ci
Ġvm linux
Ġinterrupt ed
Ġinterrupt ible
Ġcontext s
ER R
ER SP
ER IAL
fq name
Ġem bed
Ġeth ernet
Ġint ensive
Ġint fdata
Ġac curate
Ġser dev
Ġser ver
Ġbro ad
trans fer
exp ire
exp iry
Ġcomm on
connect or
process or
ĠDo wngrade
Ġinitializ ing
Ġdirect ories
IT ING
lan k
mon itor
sq poll
time stamp
ĠX TS
ĠX FR
Ġlimit s
request s
Ġfi fo
Ġinput q
Ġsub mit
Ġpe b
Ġpe er
Ġig uan
Ġno block
Ġno instr
ĠRE SET
Ġexit s
Ġexit ing
Ġupdate s
Ġtimeout s
SI MP
SI GINFO
ST ED
bit set
cb q
ph y
ph an
ph onet
ĠL o
ĠL et
ĠL ock
ĠL AP
ĠL VID
Ġsq poll
Ġtrace d
Ġtrace s
Ġtrace point
Ġrec ords
Ġres olve
Ġreport ed
Ġrelease d
ctx s
Ġid a
Ġid x
Ġname space
Ġhol tek
ĠRT A
ific ant
Ġevery whe
Ġtrans act
Ġtrans late
Ġtrans action
down grade
12 11
81 50
81 52
CM SG
EN ER
FO LD
NL DEV
SET LINK
TU NMAP
gp s
gp io
pre p
pre pared
Ġz d
Ġz one
Ġz apped
ĠIN T
loop back
Ġpr imit
Ġpr iming
seq pkt
start up
Ġmult i
Ġrep lay
Ġrep lacing
Ġback pointer
scr atch
Ġvb lank
Ġunlock ed
Ġmemleak s
unc lone
Ġpropag ation
Ġtag ged
Ġextra ct
Ġsuper flu
Ġsupport ed
control led
IC Y
UN SH
UN SP
UN TS
UN INTER
ho c
ho oks
watch ers
Ġ1 0
Ġy iel
Ġact ions
Ġact iv
lob by
store d
stream s
Ġmis aligned
Ġmis leading
Ġmis sed
Ġdetect ion
extra ct
Ġconntrack s
Ġstart ed
perf ect
ĠPro vide
prog ress
Ġexec ute
Ġexec ution
Ġstack ing
Ġpreempt ible
ĠEx tend
IG MP
LO GIC
OM M
ac ct
ac quire
ac counting
dc cp
hand ling
ring s
ring buf
ĠH old
ĠH yper
ĠH CI
ĠW ait
ĠW orkaround
Ġfin ished
Ġsi mple
Ġsi ano
Ġsm sc
Ġsignal s
Ġsignal fd
Ġtx q
alg o
Ġreq s
Ġreq sk
Ġbind er
Ġdma buf
Ġib ss
Ġhook s
Ġvt i
Ġring s
Ġunlink ed
Ġaddr conf
Ġproce ssed
Ġeb t
ument ation
Ġclean ing
new link
neigh bour
Ġcancel ation
Ġcancel ations
Ġcancell ations
disk dq
Ġvariable s
Ġseparate ly
881 78
881 79
EX TRA
EX EC
NE STED
ab ility
rate limited
sig lock
tc f
te ardown
Ġsel f
Ġtake s
Ġplace ment
Ġwalk er
Ġwalk ing
Ġver ified
change link
Ġstop ped
ĠSC O
Ġload ing
Ġlook ing
Ġhead ers
Ġhead room
Ġiter ation
Ġiter ating
Ġiter ator
Ġchain s
Ġcompat ible
ĠBH s
Ġmod ify
Ġmod ifies
Ġfiel d
host name
Ġauto clear
Ġargument s
HA SHED
SE Q
base d
dup cook
fi rmware
fi eld
me sh
me ssage
pan ic
rg rp
rw lock
rw sem
rad ix
rad iot
tf m
Ġlow er
Ġcap ture
Ġcounter part
Ġsb i
Ġsync fs
Ġtim ing
Ġtim espec
Ġtermin ated
Ġtermin ating
allow ed
Ġmd iobus
Ġmon itors
Ġbat ched
Ġima ge
Ġima geblit
Ġdestroy ing
Ġhyper call
screen buf
Ġoffs et
lib ceph
lib nvd
comm and
Ġconst raints
app ledisplay
Ġxsk map
Ġdoes n
cancel led
interrupt ible
ĠCo W
ĠCo mplete
ĠCon n
DEV ICE
ĠID s
ĠIn crease
fail s
Ġinstall ing
Ġlon ger
Ġassign ment
Ġassert s
Ġregul ar
POL ICY
Ġfilesystem s
Ġreplace d
Ġreplace ment
CPU ID
Ġnexth ops
Ġparamet er
11 1
78 30
AM IC
CLO EXEC
IP V
WA Y
ass ert
ass oc
aut h
aut ofs
aut obind
cop ied
ele vator
met alist
os f
os if
pad ata
pad to
vd pa
with draw
ĠJ itter
Ġor iginal
Ġor phan
reser ved
Ġindex es
Ġapp end
Ġapp letouch
Ġapp lications
Ġct l
Ġct netlink
Ġcla ss
Ġcsum s
Ġspec ial
Ġtra ff
Ġtap r
Ġtouch ing
Ġpan id
Ġpub lish
head room
Ġmal formed
Ġrepa ired
Ġbus y
Ġdisc iplin
ĠFor ce
Ġnfs d
Ġnode s
Ġnode id
Ġdecomp ression
Ġhard er
Ġhard ware
Ġhard coded
trig gered
Ġvs ysc
Ġpolic er
Ġrun ning
Ġka ractx
ĠAcce pt
Ġcolor map
Ġenable d
Ġxattr s
config uration
ĠDe lay
ĠDe crease
ĠDe fine
Ġiov a
Ġexp ire
ĠIRQ s
ĠTHP s
ĠMS G
ĠMS FT
Ġinstance s
Ġstructure s
mdio bus
Ġintroduce d
timeout s
Ġresol ved
Ġresol ution
Ġresol utions
Ġprint ked
Ġmultip ath
Ġsucceed s
Ġhugetlb fs
ĠQP N
Ġdynamic ally
Ġasynchronous ly
10 9
20 19
20 38
38 4
70 45
90 5
GS ERIAL
IS DN
MO RE
NU MA
NU MHO
Page Tail
Page Write
PER MANENT
RP C
STR ING
STR SET
TO DEVICE
VL AN
WR ROPT
acce ss
acce pt
break point
break points
dt or
fil ldir
ima geblit
mk iss
ob j
rs vp
sce d
tg chk
tg dtor
trap s
inf light
inst ance
regist ered
recurs ion
recurs ive
Ġfd info
Ġfw d
Ġfill ing
Ġcc id
Ġcy cle
Ġcy clic
Ġclu ster
Ġclu sters
Ġclon ed
Ġclon ned
Ġsan e
Ġsan itize
Ġsig queue
Ġsig trap
Ġsoft ware
descript or
descript ors
Ġmet a
Ġmet adata
Ġman y
Ġman ager
Ġmark ings
Ġrece nt
Ġrece ntly
Ġretrans mission
Ġds mark
Ġove flow
Ġove restimation
Ġdepen ds
Ġdepen dency
arg v
iol aten
Ġvcs u
ĠRD S
ĠRD WR
Ġleg otow
Ġleg ousbto
Ġunpar k
Ġunpar ked
cook ie
chk pt
Ġgf n
Ġgf p
unk illable
iface s
Ġcollap se
Ġcollap sing
Ġcond itions
ĠNe ver
ĠNe sted
ĠPF N
ĠDirect ly
interface s
INTER P
Ġlogic al
Ġsecond ary
ĠTrans late
ĠTrans form
Ġitem s
Ġinterval s
query cap
ĠEX T
ĠEX ITING
Ġallowed ips
Ġadv ance
Ġconnection less
Ġfragment s
Ġreporter s
Ġdeferred q
LIST ENER
NEW LINK
Ġprefix es
Ġgrab bing
Ġcharact er
Ġcharact ers
Ġchannel s
Ġowner ship
COMP AT
COMP LET
Ġsisusb vga
Ġversion ing
Ġalgorith m
Ġalgorith ms
Ġevalu ate
Ġevalu ation
08 28
14 681
24 90
200 0
35 59
650 1
602 7
700 7
980 0
900 5
906 3
Ab ort
BAL ANCING
BIND TODEVICE
CO UNTS
DON TUNMAP
DAT A
DYN AMIC
EIN TR
EMU LAT
EPER M
FER RED
GL OBAL
GATE WAY
HR D
KOB J
KEY S
LS M
LOC AL
MEMA LLOC
PAL IVE
PRE FERRED
PEN DING
PEE K
RUP TIBLE
RATE EST
SV C
SUN RPC
UAR T
Uprobe s
Ya ma
[] .
bc sp
bprint f
binf mt
blish ment
cd rom
cat map
cal ipso
catch all
dis sector
dyn root
estim ator
flo ppy
fro zen
fled ged
front ends
feature s
gy t
gue st
gpt e
gto d
gend isk
hv a
hmac s
jif fies
ker nfs
kee ptruesize
keep alive
kcs an
mer ge
mwifi ex
nof ail
nee ded
num ber
nby tes
norm al
oot b
pse udo
pver sion
pref ix
plu g
pri vs
plan es
prior ity
risc v
san itize
sign ificant
sigh and
tmp lt
vx lan
vid ioc
ww an
Ġent ity
Ġloc ation
ĠOC B
Ġram fs
Ġrap id
insp ect
rever se
reuse port
Ġfan out
Ġfuzz ing
ethh dr
Ġinject ed
Ġinstr umentation
Ġinstruct ions
Ġinact ive
Ġatr ibutes
Ġabu se
Ġawa y
Ġaes ni
Ġavail ability
onal ity
Ġclc sock
Ġciner gyt
Ġsle ep
Ġsen se
Ġsid tab
Ġsem aphore
Ġsent inel
Ġsnt o
Ġsla ve
Ġsms usb
Ġspar ing
Ġspe ed
Ġsmack fs
lear n
desce ndant
atta ch
Ġtone port
Ġtemp orary
Ġtioc sti
Ġpul led
Ġpress ure
Ġpers onality
Ġpvc lock
Ġphys ical
alig ment
semap hore
secur ity
secre tmem
segment s
Ġudma buf
Ġumount s
Ġmmp ut
Ġmig ration
Ġmic rotek
Ġmula w
anch ored
Ġregist ered
Ġrealloc ation
Ġrecur se
Ġreconfig ure
Ġbot tom
Ġboost ing
Ġbpq ether
Ġdock et
Ġdig itv
Ġdir s
Ġdbe lls
Ġdrb g
Ġwid th
Ġwatch points
Ġwas n
Ġwrit ing
Ġiop rio
Ġoth er
Ġocc upied
Ġnif ty
Ġdecaps ulation
Ġdecrement ing
Ġdefere ncing
Ġderegist raion
Ġdeprec ated
Ġhis ilic
Ġhang up
Ġhfcs usb
reexpan ded
ioper m
except ions
Ġvis ible
Ġvmem dup
Ġvie w
Ġvicode c
Ġviol ation
ĠRFC OMM
Ġpois on
Ġpower pc
Ġpopul ating
Ġrand om
Ġrhash table
Ġrule s
Ġkvc alloc
Ġkfi fo
liber tas
Ġunco ditionally
Ġunun it
Ġunmo vable
Ġunpro cessed
Ġunint ended
Ġunexp ected
Ġuncondition ally
Ġunkno wn
Ġunwin ding
Ġuntermin ated
Ġmemcp y
Ġmemslot s
comb ination
outstand ing
Ġgig aset
unconf irmed
Ġfastop en
Ġaltset ting
Ġprocce ssing
Ġproto col
Ġprodi keys
volu me
Ġskcip her
ĠASA P
ĠApp ly
ĠARP HRD
Ġcook ie
Ġcoale sced
apparm or
ofda y
Ġansw ers
Ġancestr y
Ġencrypt ion
Ġesta blishment
Ġelimin ate
ĠPost pone
ĠPOLL FREE
strpar ser
profil ing
ĠSynchron ize
ĠSIG KILL
ĠSynth etic
ĠDRE G
ĠDEST ROY
ĠDEAD LINE
Ġsettime ofday
ĠCASE FOLD
ĠCPU ID
Ġcanonic alize
DEST ROY
DELA YED
Ġshrink er
Ġinformat on
Ġexcess ively
Ġexcept ion
ĠICM P
ĠImpro ve
ĠImmediate ly
Ġoutgo ing
Ġsecle vel
Ġsearch ing
depopul ate
ĠTUN SETLINK
ĠTIOC GSERIAL
ĠTVL V
ĠTAS K
Ġtrunc ate
ĠMRE MAP
ĠMbp s
Ġinterpre ter
Ġcontroll ers
doorbe lls
Ġprereq s
Ġpredic ate
READ Y
REMO VE
RETPO LINE
ĠETHTO OL
ĠErr or
ĠElectr ic
ĠBIND ING
ĠKEE PALIVE
ĠKFEN CE
Ġtechnis at
Ġunbalance d
Ġblksz bits
Ġkeycode s
Ġkeybo ard
subscript ion
subsystem s
Ġrobot fuzz
ERSP AN
Ġembed d
ĠXFR MA
Ġiguan air
SIMP LE
ĠLAP IC
Ġeverywhe re
Ġtransact ions
Ġprimit ive
Ġsuperflu ous
UNSH ARE
UNSP EC
UNINTER RUPTIBLE
Ġyiel ding
Ġactiv ated
LOGIC AL
diskdq b
radiot ap
Ġhypercall s
libnvd imm
Ġtraff ic
Ġdisciplin es
Ġvsysc all
NUMHO OKS
PageWrite back
iolaten cy
Ġlegotow er
Ġlegousbto wer
COMPLET E
14681 8
EMULAT ED
Ġhisilic on
